[
    {
        "id": "001",
        "title": "NUS enters top 10 in global university ranking for the first time",
        "content": "SINGAPORE – The National University of Singapore (NUS) has broken into the top 10 in a global ranking of institutions for the first time. It emerged eighth in the latest Britain-based Quacquarelli Symonds (QS) World University Rankings 2024 released on Wednesday. It was previously 11th in the 2023 edition, which was released in 2022. It is the highest-ranked Asian university and the first from Asia to be placed among the top 10 in the table, which is dominated by universities from the United States and Britain. The chart is topped by the Massachusetts Institute of Technology, as it was in previous years, followed by the University of Cambridge and University of Oxford. Harvard University is fourth, and Stanford University fifth. The latest QS ranking is the 20th edition and features updated methodology using three new metrics – an institution’s commitment to sustainability, employment outcomes, and international research network. QS has also made some changes to the weighting of some existing indicators: academic reputation, employer reputation and faculty-to-student ratio. For example, academic reputation is now worth 30 per cent, down from 40 per cent, while employer reputation is accorded 15 per cent instead of 10 per cent previously. NUS came in seventh for employment outcomes and 15th for academic reputation. It ranks 54th globally for employer reputation and 64th for citations per faculty, which measures research impact. In a statement, NUS president Tan Eng Chye said: “This is a historic first for NUS to be placed within the top 10 globally, amongst many other prestigious institutions worldwide. This is a testament to our capabilities and commitment to providing a world-class and interdisciplinary education to nurture agile and resilient graduates with diverse skills and knowledge for an ever-changing world.” He added: “This achievement was made possible by the excellent contributions and outstanding work of our talented faculty, staff and students who remain deeply committed to flying the flag of our distinguished quality of education and creating positive impact in the classroom and beyond.” QS chief executive Jessica Turner said: “This unprecedented milestone marks a remarkable moment for Asian higher education and showcases NUS’ dedication to research excellence, innovation and sustainability.” Nanyang Technological University was ranked 26th in the latest table, down from 19th in the previous edition. Singapore Management University was in 545th position, and the Singapore University of Technology and Design made its debut in 429th place."
    },
    {
        "id": "002",
        "title": "NUS and NTU cast wider net for students through aptitude-based admissions",
        "content": "SINGAPORE - The university admissions period is ongoing, and applicants from polytechnics and junior colleges (JCs) are awaiting the results of their applications.\n\nThe good news for them is that in 2024, both the National University of Singapore (NUS) and Nanyang Technological University (NTU) are casting a wider net to consider more applicants through aptitude-based admissions, where achievements and talents outside of academics are considered. The two universities are increasingly employing a broad set of qualitative assessments, including interviews, aptitude tests and portfolios, to assess an applicant’s potential beyond his or her grades.\n\nThey also take into account achievements in sports, arts, entrepreneurship and volunteer work. For students who have experienced setbacks, they ask how these were overcome.\n\nNUS and NTU took in the bulk of the 18,500 students admitted into the six publicly funded universities in 2023, with NUS taking in more than 7,400 freshmen and NTU taking in 6,400 students.\n\nNTU said that in 2023, more than half – 57 per cent – of its 6,400 freshmen were offered places based on aptitude-based admissions. This was up from about a third of students, or 38 per cent, in 2019.\n\nNUS declined to provide figures on the proportion of its freshmen in 2023 who were accepted through aptitude-based schemes. It would only say that the number increased significantly compared with five years ago.\n\nThe university said it has also expanded its holistic admissions process by introducing special schemes aimed at identifying applicants with specific talents and aptitudes. One of the first of these schemes, launched in 2019, is the Polytechnic Entrepreneurship Pathway nomination scheme, where NUS asks the five polytechnics to nominate students who display a strong entrepreneurial inclination during their diploma studies.\n\nNUS said that over the past few years, it has launched similar nomination schemes, for example, to identify JC students who have demonstrated strong aptitude for computing despite facing exceptional circumstances or challenges. In 2023, NUS introduced a scheme for polytechnics to nominate students with potential in social work. In 2024, it is expanding the scheme to include JC students.\n\nNUS dean of admissions Goh Say Song said that since 2023, NUS has asked all applicants to respond to five short questions, including questions on their proudest achievement and what is meaningful to them. He said prior to that, students were asked to include a personal statement, but it was optional.\n\nProfessor Goh said: \"So, currently, if a reasonably good student falls short in some way, we will go back and look at the responses to the five questions. In this way, we are giving more students the opportunity to be considered beyond their grades, using broader criteria.\"\n\nOfficials from both universities stressed that aptitude-based admissions do not mean that they do not take academic grades into account, as admission dons still look at whether an applicant will be able to handle the rigours of degree studies.\n\nApplicants also have to meet the minimum grades for subjects related to the course of study. To study mechanical engineering at NUS, for example, an H2 pass in mathematics or further mathematics is required. For law, at least a B in General Paper is needed.\n\nExplaining why NUS is in favour of going beyond grades, Prof Goh said: \"Academic grades can only tell you so much about a student. Through the interviews, portfolios and aptitude tests that NUS uses, the university can assess their interests and aptitude for a particular field.\"\n\nHe added: \"We are also keen on those with talent in the arts or sports. It adds to the vibrancy of the NUS student body.\"\n\nNTU provost Ling San said aptitude-based admissions enable NTU to assess a bigger pool of students with a wider range of academic abilities, and offer places to those whose strengths are better aligned with the university’s academic offerings.\n\nProfessor Ling said: \"For the university, aptitude-based admissions benefit the wider student community by allowing for greater diversity on campus and fostering inclusion, enthusiasm and excellence.\"\n\nTwo NTU freshmen who were selected after having gone through aptitude-based admissions said they were grateful that Singapore’s two biggest universities are increasingly applying broader criteria in selecting students.\n\nNTU undergraduate Edwin Chew, 24, who is in the Singapore men’s national handball team, was glad that his university took into account his sporting achievements when considering him for a place in the maritime studies degree course.\n\n\"I started playing handball in Secondary 1 and have grown to love the sport. And I am proud to be part of the Singapore team that won medals at some significant competitions, including the SEA Games. I never thought that one day my sporting achievements would land me a place in a university when my results fell slightly short of the entry requirement.\"\n\nMs Nishaa C., 24, who did poorly in JC but excelled in her polytechnic studies after her A levels, said NTU took into account how she overcame the challenging circumstances she faced to go on to do well at Republic Polytechnic. She also stood out for her contributions to community involvement projects at the polytechnic.\n\n\"I did poorly in JC because I had to work to help support my family, which meant that I had little time for my studies. But I did much better at Republic Polytechnic, although I had to work daily at my father’s hawker stall to help him. So, although my grade point average was a little below the entry score for the Bachelor of Science degree, they took into account my family challenges, as well as the community involvement projects that I was involved in,\" she said.\n\n\"If not for aptitude-based admissions, I would not have had the opportunity to show that I am deserving of a place in NTU.\""
    },
    {
        "id": "003",
        "title": "More fresh university grads found full- time jobs last year, salaries inching up",
        "content": "SINGAPORE - More university graduates secured full-time jobs last year, as Singapore's economy grew and recovered from a recession brought on by the Covid-19 pandemic. Results from the latest graduate employment survey showed that 84 per cent of fresh graduates in the labour force were in full-time permanent roles, compared with 69.8 per cent in 2020. Overall employment rates and salaries among those who graduated from universities last year also both inched up, according to the poll results released on Wednesday (Feb 16). The median gross monthly salary among graduates in full-time permanent jobs climbed from $3,700 in 2020 to $3,800 last year. The figure was $3,600 in 2019. And 94.4 per cent of university graduates found permanent, freelance or part-time jobs within six months of graduation last year, up from 93.6 per cent in 2020. These findings come after the five polytechnics here released their set of outcomes for graduates last month, which also showed improvements in employment rates and salaries last year compared with 2020. The latest survey polled 11,200 fresh graduates of full-time programmes in the National University of Singapore (NUS), Nanyang Technological University (NTU), Singapore Management University (SMU) and Singapore University of Social Sciences (SUSS). The graduates were asked about their employment status as of Nov 1. The surveys for Singapore Institute of Technology (SIT) and Singapore University of Technology and Design (SUTD) are ongoing and the results will be released at a later date. Singapore's economy grew by 7.2 per cent last year, rebounding from a recession as the country eased Covid-19 curbs, allowing for more economic activity and a boost in demand for goods and services. The economy contracted by 5.4 per cent in 2020. Reflecting the rebound, the unemployment rate for university graduates went down from 6.4 per cent in 2020 to 5.6 per cent last year. Fewer graduates - 8.7 per cent - were also in part-time or temporary work, compared with 22.3 per cent in 2020. These figures include those on the SGUnited Traineeships Programme, which was set up in 2020 to help fresh graduates boost their employability. Several fields of study - information and digital technologies, built environment, business and engineering - continued to do well and recorded the highest proportions of graduates in full-time permanent jobs. Graduates from information and digital technologies in particular took home the top pay of $5,000, up from $4,760 last year and $4,400 in 2020. Mr Rafid Zuhayer Amin, who graduated from NUS last year with a mechanical engineering degree, landed a position in global healthcare company GSK's talent development programme after a four-month job search. The 26-year-old, who specialised in robotics, applied for the role after seeing an e-mail about the programme that a career counsellor had sent him and his schoolmates. He is now a maintenance engineer. 'I was confident of my abilities, however, I had concerns about finding a job with the uncertainties presented by the pandemic. Another concern was my compatibility with the jobs offered. Thankfully, it all worked out and I am happy here,' he said, adding that he enjoys finding the best engineering solutions that will improve lives. The four autonomous universities - NUS, NTU, SMU and SUSS - also conducted a survey on graduates who typically require postgraduate practical training before they can practise their professions. They include those in architecture, law and medicine. About 800 graduates took part, representing a response rate of 71.6 per cent. The survey showed 98.1 per cent of them were employed after the completion of their practical training stint, a slight increase from 96.8 per cent in 2020. The median gross monthly salary among these graduates with full-time permanent jobs grew from $4,625 in 2020 to $5,000 last year. In Wednesday's joint statement, the six universities, including SIT and SUTD, said they have kept up with efforts to support graduates amid the pandemic, through extensive career guidance and job matching, and tapping industry partners to curate suitable job placement and apprenticeship opportunities."
    },
    {
        "id": "004",
        "title": "SUTD forms global alliance with 12 institutions to enhance design education",
        "content": "The Singapore University of Technology and Design (SUTD) has formed a global alliance with 12 institutions to enhance design education. These include local institutions such as Nanyang Academy of Fine Arts (Nafa) and Lasalle College of the Arts, as well as foreign ones like Tsinghua University Academy of Arts and Design in Beijing and Parsons School of Design in New York. The alliance, which was launched on May 15, will explore student and faculty exchanges, and other forms of collaboration to bring students from different fields of study together as they solve real-world design problems. Representatives from the 13 institutions gathered on May 15 at the SUTD Design Innovation Forum-Design Alliance Summit, held at the university, to discuss the impact of artificial intelligence and advanced technology on design and education, among other topics. Education Minister Chan Chun Sing, who graced the event and participated in a roundtable discussion about the future of education, said design plays an important role in tackling Singapore’s future challenges, such as transitioning to clean energy. He said design thinking was present in the early years when Singapore had to overcome challenges despite its limited resources, adding that for students to develop design thinking, they should have a deep sense of appreciation for society’s challenges. Said Mr Chan: 'If they (students) truly want to be good designers, they need to fall in love with the problem, rather than the solution, to have a deep understanding of the kind of challenges and the needs of the society.' He said design should be looked at not only in narrow terms such as the manufacturing of products, but also in a broader context, in terms of shaping policies, bringing people together and making use of Singapore’s finite natural resources. Mr Chan used the nation’s housing policies and Central Provident Fund scheme as examples of design thinking. 'It’s not just about building flats and houses but how we have housing policies to integrate people from different backgrounds, living harmoniously together, that helps in our social cohesion. How we design policies to give people the sense of assurance that they can retire properly, adequately.' He added that design thinking was also present in urban planning, where every inch of space from the land, sea and air had to be finely designed to accomplish the nation’s goals. 'Singapore is, if you like, excellence by design, and we try not to leave everything to chance. But I think we also appreciate the serendipitous moments where we get inspiration from the exchange of ideas from many of you.' SUTD president Chong Tow Chong said that in an era fraught with environmental challenges and social transformation, the role of design in society has to be redefined. SUTD chairman Lee Tzu Yang said that even with the most amazing technological innovation, human needs and challenges have to be addressed. 'Today, our complex challenges such as population health and sustainability call for both technology and design-led innovation to spur behavioural changes for a better outcome,' he said. 'There is a worldwide need for talent in the design and technology field to tackle our most pressing problems.'"
    },
    {
        "id": "005",
        "title": "'First 2 years of university have been very dry': Undergraduate who enrolled during pandemic",
        "content": "Ms Diviya Vega, 23, is a history undergraduate at Nanyang Technological University (NTU). I started university at NTU in August 2020, several months after the Covid-19 pandemic hit Singapore. It was very restrictive and I wasn't able to enjoy the full uni experience with orientation and camps, which are a big part of university culture. So a lot of the time, I found myself figuring things out on my own. My experience was very much just me behind a screen. I stay in the hall as well and that experience was very much confined. A lot of events that they would typically hold physically went online and it did not feel the same so I wouldn't attend them. For example, I didn't attend my hall orientation camp which was held online. It felt very artificial and forced to me. Meeting people and making friends required more effort because I had to take the initiative to strike up conversations with them. It was less of an organic process. I think if it weren't for the pandemic, I would be able to make more friends from other courses as well. However, right now most of my friends are only from my course. Even in the hall, my only friend is my roommate and another girl I'd met before the pandemic. However, home-based learning was ideal for me academically. I was able to perform well because I spent most of my time at home studying. In return, I got good grades. I did not get Covid-19 but my friends did. This affected their health and they also had to deal with it alongside assessments. My roommate tested positive for Covid-19 too - last November - and during that time, I went back home while she quarantined in our dorm room. Hall life was greatly affected because communal dining was not allowed due to the limits on group sizes. Even if we did dine together, there was no intermingling. We were also not allowed to gather in rooms in a huge group due to Covid-19 protocols. All these experiences made starting university very different from what I thought it would be like. I expected it to be more interactive and fun. I thought I would get to go to a lot of events and mingle with people. I would say my experience was very dry, due to the pandemic. But now that the Covid-19 situation in Singapore is improving and restrictions are lifting, I am optimistic that now I may be able to get the full university experience. I'm very much looking forward to social events as well as taking part in competitions since these would now be in-person. I'd like to get involved in debate competitions and also get a diving licence since NTU has diving as a co-curricular activity. The pandemic has limited what I can do so far - I haven't pursued it because I wanted the full diving experience and that would mean going to Tioman Island in Malaysia. Tioman is known for its beautiful and clear sea. Due to the pandemic, we were restricted to Singapore waters, not the ideal place for diving, I feel. I feel like these things would elevate the whole university experience for me. I've lost two years of what university life can be but I'm hopeful I can make the best of my next two years."
    },
    {
        "id": "006",
        "title": "SMU graduates to get transcript of co- curricular activities and skills learnt, starting in 2025",
        "content": "Students from Singapore Management University (SMU) will soon have a transcript recording their co-curricular activities (CCA) and the skills they have learnt – a first among universities here – in a move to go beyond academic grades. The graduating class of 2025 will be the first to receive this transcript, which was announced on Thursday at an SMU symposium on holistic education and skill sets employers are looking for. At the event, SMU president Lily Kong said the transcript will indicate the extent to which graduates have demonstrated 'learning outcomes', or skills and knowledge, through their co-curricular activities. These have three achievement levels – exposure, integration and transformation – to indicate a 'progressively more impactful experience,' she said. The learning outcomes include intellectual and creative skills; interpersonal skills; global citizenship; and personal mastery. Students who show strong growth in these areas will earn digital badges showcasing their achievements. The badges can be used on their social media platforms – for example, in their LinkedIn profiles. Professor Kong said the aim was to promote a culture of meaningful reflection, and guide students in deepening and documenting their learning. 'In so doing, we empower students to enhance their self-awareness, reflect on what it is they are learning and articulate areas of personal growth.' Information for the transcript is drawn from the Integrated Co-Curricular Management System, an online platform SMU piloted two years ago for students to document their learning experiences and submit reflections, and for instructors to provide feedback. SMU said feedback collected by its co-curriculum development unit in September 2022 from more than 200 second-year students showed that about 97.5 per cent of them strongly agreed or agreed that a formal record documenting their co-curricular involvement should be issued by the university upon graduation. Prof Kong said SMU has always encouraged students to engage in experiential learning. 'Oftentimes, the really valuable lessons in life take place outside of the classroom,' she said. 'In fact, SMU was the first local university to introduce both internship and community service as graduation requirements – 23 years ago at our inception. All our undergraduates are required to complete at least 10 weeks of internship and a minimum of 80 hours of community service. The vast majority of our graduates do more than that.' Beyond these mandatory requirements, SMU students can choose from opportunities like global exposure programmes or project-based learning, or join student organisations that span the arts, sports, student leadership and special interest areas. 'However, the learning from these experiences should not be left to chance alone,' said Prof Kong. 'Rather, these experiences can be carefully and intentionally curated and aligned with clearly defined learning objectives.' Education Minister Chan Chun Sing, who was the guest of honour at Thursday’s event at the university’s campus in Bras Basah, said SMU’s co-curricular transcript is 'a part of the manifestation of our belief in a world that celebrates multiple pathways of success.' 'It also emphasises to students the range of life skills and qualities needed to succeed in the future, beyond academic grades. It signals to future employers the diversity of experiences and exposures our students have gone through that will add to their ability to learn and evolve at speed to be prepared for the future,' he added. More than 200 industry partners, educators and students attended the symposium, which featured a panel discussion chaired by Prof Kong on the skill sets employers value. The panel comprised Mr Chan; SMU chairman Piyush Gupta; Dr Michael Preston, executive director of Florida Consortium of Metropolitan Research Universities; and Ms Melissa Aratani Kwee, chief catalyst and former chief executive of the National Volunteer and Philanthropy Centre. While recognising students’ co-curricular involvement and skills is a good move, Mr Gupta sounded a word of caution that institutions do not overdo it, as it may then become overly regimented. Ms Kwee said one fear is that this exercise could become another source of stress for students, who may feel they have to do well in activities outside of the classroom on top of their academic performance. Speaking to reporters, she said: 'What’s important is for the individual to see it as an invitation to make sense of your own experiences, not to do this or that, or to fit a certain mould. That’s not the intent of this transcript.' Ms Kwee added that the co-curricular transcript could help employers better assess candidates. 'At the end of the day, you’re hiring a human being... You want to know his or her relational skills, how they are able to empathise or have diverse exposure.' Second-year computing and information systems student Andrew Ng, 24, the president of SMU Caderas Latinas, a salsa dance club, said he hopes employers will look at co-curricular transcripts, which tell 'another side of the story' and show students’ passion beyond academic areas. 'I don’t see it as another requirement to fulfil but about furthering your interest and growing as a person.'"
    },
    {
        "id": "007",
        "title": "Universities in Singapore focusing research efforts on solving global post- pandemic problems",
        "content": "Universities here are altering their research landscape to emphasise interdisciplinary and results-driven studies. This is meant to find more solutions for pressing global issues such as food security and public health - the challenges of a post-pandemic era. Late last year, the National University of Singapore (NUS) launched a research programme and fund to put together 100 cross-faculty research teams in five years, with the aim of getting 20 new projects running every year. Injecting up to $20 million a year on the Reimagine Research Initiative, NUS will fund interdisciplinary studies that go beyond getting published in prestigious journals, to making impact in the real world. The initiative has enrolled 21 groups so far, and it is set to be one of the largest university-wide research programmes, said NUS deputy president of research and technology Chen Tsuhan. In January, the Nanyang Technological University (NTU) unveiled its five-year plan detailing goals in education and research. A key tenet of its plan is to support interdisciplinary research to address global challenges, and find ways to accelerate innovation from research discoveries. At NUS, Professor Chen said faculty members are adept at going deep into their specific areas of interest, and are driven by their own curiosities and passion. But to 'create powerful, unconventional solutions', researchers must work across schools, and that is where Reimagine Research comes in, he added. One of the 21 teams has pulled in plant biologists, engineers and computer scientists to develop 'wearables' for crops to track their growth and health in urban farms. Once attached to a leaf, the tiny chip containing sensors will detect plant signals to predict problems such as infection and damage. 'We are definitely short of tools in detecting and interpreting such plant signals to impose early intervention,' said Assistant Professor Chae Eunyoung from the NUS' Department of Biological Sciences. The project's ambition is to build a system that will tell farmers the optimal conditions to grow various types of vegetables as the temperature gets warmer and water becomes scarcer, among other changes in the environment. It may then be possible to breed more resilient plants that can survive and thrive in drought. The NUS programme will invest in projects covering issues such as sustainability, disease outbreak preparedness, supply chain resilience, human behaviour and policies, as well as IT security and privacy. Although post-pandemic research priorities have emerged, universities here are also still busy with projects related to Covid-19 and infectious diseases. NTU is investing in a new state-of-the-art Biosafety Level 3 Laboratory - a high containment-level facility where researchers can work with highly infectious and potentially lethal microbes. In last year's edition of its yearly internal research grant call, the Singapore Management University (SMU) encouraged its faculty to submit their Covid-19-related research proposals. The university has been researching the business, economic, social and legal effects of the pandemic. Innovation-driven projects born from the pandemic at the Singapore University of Technology and Design (SUTD) include designing housing models for foreign workers to prevent cross-contamination and optimise ventilation, and developing a breath sensor to detect Covid-19 using chemical gas sensing techniques using a mobile phone. Last September, SUTD also started a research programme that will delve deeper into the changes in offices and the Central Business District, as flexible work arrangements may be here to stay. For instance, small businesses may be impacted as they rely on the office crowd to survive. At the Singapore University of Social Sciences (SUSS), studies were conducted by both students and faculty, with many of them scrutinising how social factors and people's behaviour and emotions were changed by stressors in the past year. An SUSS researcher is working on a global study to find out how people from different nations have been using digital devices to sustain or create social connections, and reduce loneliness in the time of social distancing. Meanwhile, the Singapore Institute of Technology's Chemical Engineering and Food Technology cluster's research efforts are focused on developing technologies needed for modern vaccines and future therapies. The research taps the university's specialised pilot scale equipment that uses cells to make products."
    },
    {
        "id": "008",
        "title": "NUS grad rejected Google job and now builds floating gardens",
        "content": "Mr Muhammad Ibnur Rashad Zainal Abidin started an innovation lab for social and environmental good with just $7,000 in seed funds, despite getting a job offer from Google in 2011. Ten years later, the 35-year-old Singaporean has since invented an electricity-free bamboo speaker and a floating garden system inspired by the Aztecs. The founder and chief innovation officer of Ground Up Innovation Labs for Development (Guild) was among 17 people to receive the National University of Singapore's Outstanding Young Alumni Award last Friday (Nov 5). Mr Ibnur's love for inventing began in primary school, he says, through tinkering with Lego, poring over books on inventors and watching almost every episode of a television show, A Stroke of Genius, which featured creative solutions to everyday problems. When he was 16, he co-created a novel laser interferometer, a machine which uses lasers to make very precise measurements, with other students and an NUS Engineering professor. The work was published in a scientific journal. Yet, the prospect of making his passion a career took root only in 2009 during a work-study NUS Overseas Colleges programme in Silicon Valley. 'That gave me a bit of confidence that I could actually chart this path. If people have done it in the United States, why not in Singapore?' said the engineering science graduate. The final push to create an invention studio for the community came from the late founder of non-profit Ground Up Initiative (GUI) Tay Lai Hock, who convinced Mr Ibnur that he should explore while he was young. Mr Tay started GUI in 2008 with the goal of creating a '21st century kampung culture'. In 2018, he died suddenly when he was 54. So the fresh graduate co-founded the Sustainable Living Lab in 2011 with two friends from the NUS University Scholars Programme under a university grant. The trio, who had met in an engineering course during their second year, previously won the Mondialogo Engineering Awards twice. The now-defunct competition by Unesco and automotive manufacturer Daimler brought together engineering students from around the world to engineer solutions to eradicate poverty and promote sustainable development. One of the team's ideas - a low-cost solar pond fruit dryer - continues to help fruit farmers in India reduce post-harvest losses, said Mr Ibnur. 'To see inventions (like this) go into the world and impact people is something that keeps me going,' he added. In 2016, he started Guild as an invention studio to create solutions and training programmes involving nature, technology and the community. The consultancy now has spaces in GUI's Kampung Kampus in Yishun and Tai Seng. Next, Mr Ibnur hopes to roll out his award-winning floating gardens, dubbed Floating Chinampas, to help boost food security here. Kangkong, laksa leaf and basil are some of the edible plants grown on the floating agricultural module that has taken almost 10 years of refining to withstand heavy rain, among other issues. While the invention bagged a gold award at the Taipei International Invention Show & Technomart in 2017, trialling the project has hit a regulatory wall since then, said Mr Ibnur. Currently, the prototype is piloted at GUI's Kampung Kampus and Science Centre, and the team is desperate to find more private water bodies because it does not have permission to trial the prototype in public waters. 'My only request is a private water body (to trial the garden in),' he added. 'That will be really awesome for us because we need to demonstrate a pilot and water sampling to show that this (technology) is safe for Singapore to adopt.'"
    },
    {
        "id": "009",
        "title": "NTU keeps top spot on best young university ranking, up to 2nd on another list",
        "content": "Nanyang Technological University (NTU) has again been named the world's best young university by Quacquarelli Symonds (QS). This is the seventh consecutive year NTU has topped the education consultancy's Top 50 Under 50 ranking, released yesterday. It is a league table of the world's academic institutions that were established within the last 50 years. In another ranking of young universities released yesterday, by London-based leading education magazine Times Higher Education (THE), NTU moved up one notch to second place, behind Hong Kong University of Science and Technology. QS research director Ben Sowter praised NTU for its 'amazing ascending trajectory in the QS rankings'. Mr Phil Baty, THE's chief knowledge officer, said: 'NTU's rapid development has been so extraordinary that it is already clearly established as one of the world's leading universities. But this focused ranking, looking only at institutions under 50 years of age, really highlights the exceptional progress NTU has made on the world stage in a matter of a few decades.' Such rankings, though, come at a time when higher education has been disrupted by the coronavirus pandemic, with campus closures and teaching and examinations moving online. It has also led to calls to pause these rankings. NTU president Subra Suresh said: 'The Covid-19 global pandemic has reinforced to the entire world the important role and significant value of universities for societies... NTU Singapore is proud that our dynamic campus community has played its part, in collaboration with many others, in supporting the global, regional and national responses to the pandemic. Whether we are dealing with a global pandemic, climate change, societal disruptions arising from the fourth industrial revolution, or any other major challenge faced by the world today, we see that young Asian universities such as NTU are punching above their weight in creating new knowledge and technologies and in benefiting society.' The QS Top 50 Under 50 applies the same methodology used in its world rankings based on six indicators: academic reputation, employer reputation, citations per faculty member, faculty/student ratio, international faculty ratio and international student ratio. THE's Young University Ranking compares universities below 50 years of age, based on research, teaching, citations, international outlook and industry income."
    },
    {
        "id": "010",
        "title": "New SUSS centre launched to boost non-profit sector through education and research",
        "content": "Efforts to step up education and research for non-profit organisations to help vulnerable members of society will get a boost with the new formation of the Centre of Excellence for Social Good at the Singapore University of Social Sciences (SUSS). The centre will bring together expertise from the non-profit, public and private sectors to collaborate to enhance the non-profit sector's capabilities and practices. It will have courses to train and educate volunteers and staff of non-profits in the areas of digitalisation, productivity, organisation effectiveness and governance. The centre will also conduct research to help inform policies and direct effort where it is needed, and identify where partnerships and collaborations will be most effective. Minister for Culture, Community and Youth Edwin Tong said: 'In times of change and uncertainty, there is a pressing need for non-profits to improve capabilities. In doing so, non-profits can better engage givers, adapt the modality of volunteering programmes, and also deliver services that best suit the needs of vulnerable groups. The launch of the Centre of Excellence for Social Good is indeed timely. It is also crucial in developing capabilities in the non-profit sector.' With non-profits having stronger capabilities, the whole non-profit sector will become more trusted and vibrant, and be able to effectively partner one another to address needs in a more coordinated and systematic way, he added. 'For SUSS, the addition of this Centre will bring social sector networks to us, extend our reach into the community, and strengthen our commitment of promoting engagements for social good,' said Professor Cheong Hee Kiat, president of SUSS. 'There are calls for increasing partnerships and coordination to provide services on the ground. But the collaborative focus can also be increased in education and training, applied research, advocacy and informing and strategic collaboration,' he said. One non-profit that hopes to benefit from the new centre is Lions Home For The Elders, which aims to tap SUSS' expertise for its clinical staff to further their education and improve their professional capabilities. Its board chairman, Mr Henre Tan, said that the home can provide data to SUSS for research in eldercare, which the centre can analyse. The home could use the findings to review its processes, he added. To launch the new centre, the university signed a memorandum of understanding with the SG Cares Office, a unit under the Ministry of Culture, Community and Youth (MCCY) on Friday (Nov 6). The SG Cares Office will provide support and resources to the new centre to form partnerships between the private and people sectors and promote ground-up initiatives and encourage volunteerism. The memorandum was signed by MCCY deputy secretary Ang Hak Seng and SUSS provost Tsui Kai Chong, and witnessed by Culture, Community and Youth Minister Edwin Tong and SUSS president Cheong Hee Kiat."
    },
    {
        "id": "011",
        "title": "Universities ramp up places for computing courses",
        "content": "A growing demand for graduates trained in areas such as artificial intelligence, data analytics and cyber security has seen local universities ramping up related course offerings and vacancies for the new academic year starting in August. Nanyang Technological University (NTU) said it has allocated 675 places for its 10 computing-related undergraduate programmes this year, up from 450 in 2015. It has been producing more than 500 graduates on average from computing-related programmes every year since 2015. Similarly, the Singapore Management University (SMU) sent out more than 250 graduates from its School of Information Systems each year between 2016 and 2018. \"This figure is set to increase,\" SMU said, adding that the targeted intake this year is 450. SMU also previously announced that it will offer two new computing-related degree programmes: computer science this academic year, and computing and law in 2020. As for the National University of Singapore (NUS), the intake for its School of Computing has almost doubled from about 500 in 2015 to 1,000 last year. A similar number of students is expected for this year's intake. Results of the latest Graduate Employment Survey released late last month showed fresh graduates in the information technology sector posting the highest rates for full-time permanent jobs last year. Those in courses such as computing, business analytics and information security also earned the highest median gross monthly pay of $4,100, compared with other graduates. Observers say the demand is fuelled by the rise of e-commerce platforms, and even non-tech sectors like healthcare or shipping. Professor Pang Hwee Hwa, dean of SMU's School of Information Systems, said: \"Computing is reaching into every industry, creating new jobs and changing existing ones. Companies and public agencies are employing digital technology to transform their business models and processes.\" E-commerce platforms have also been hiring more people skilled in IT as data is at the core of their businesses, said Mr Lim Teck Yong, head of regional operations and people team at online marketplace Shopee. \"Consumer behaviour is constantly changing, and it is crucial for us to understand what our users are looking for and to meet those needs,\" he added. Other prospective - and popular - employers include Facebook, Google, Grab and the various banks, say observers, citing computing specialisations ranging from \"techie\" roles like developing hardware and software, to analyst roles that involve crunching information and data, or strengthening systems against fraud. NUS dean of computing Mohan Kankanhalli said that Singapore needs computing talent, with Singaporeans forming a sufficient number. \"Just like how you would never outsource your military to any other country in the world, you cannot outsource your computing technology,\" he added. Parents are also seeing the benefit of exposing their children to skills like computational thinking at a young age, according to a survey of more than 400 parents conducted by a group of final-year communications students at NTU. The group came up with a campaign that aims to equip children aged four to seven with these skills, which are fundamental to understanding coding and programming. They have lined up free resources and workshops that are open to families from all backgrounds. Professor Kankanhalli said being good in mathematics is an important prerequisite - even an arts student who did maths at the H2 level could be considered, he said. \"These days, learning is not all about books... Most of all, you should have a passion for computing and a desire to make a difference in the world,\" he added. Prospective students at an open house at the weekend. The intake for its School of Computing nearly doubled from about 500 in 2015 to 1,000 last year. A similar number of students is expected for this year's intake."
    },
    {
        "id": "012",
        "title": "Slowing economy not a blip for fresh grads in job market",
        "content": "A depressed economy does not seem to have stopped a vast majority of Singapore university graduates from landing jobs last year - and ones with fatter starting salaries at that. The latest joint graduate employment survey has found, for example, that nearly nine in 10 (89.7 per cent) members of the Class of 2016 in the labour force said they found jobs within six months of their final examinations. This was slightly higher than the 89.5 per cent who did so in 2015. And the mean gross monthly salary of those in full-time jobs was S$3,515, up from S$3,468 for their 2015 counterparts. The survey findings, released on Wednesday, were drawn from the responses of 10,904 out of 13,953 fresh graduates from National University of Singapore (NUS), Nanyang Technological University (NTU) and Singapore Management University (SMU). The respondents were asked for details of their employment status as at last Nov 1, which was about six months after they had completed their final examinations. Although nearly nine in 10 in the labour force found jobs within six months, the proportion of graduates who managed to secure permanent full-time employment fell to 80.2 per cent, down from the 83.1 per cent who did so in 2015. A person is part of the labour force if he is working, or not working but is actively looking and available for work. A further 9.5 per cent of the respondents indicated they were employed part-time or on a temporary or freelance basis last year. Those who chose this route said they were pursuing or preparing to pursue further studies, starting a business venture or trying out a new field. Of the three universities polled, graduates from SMU emerged tops, with 93.8 per cent of them getting a job within six months of their final exams. The rate was about 90 per cent for NUS and NTU graduates. SMU said more than half (51.3 per cent) its graduates in full-time employment received two or more job offers. Among those who received a job offer, one in four landed full-time jobs through internships, which are compulsory for the university's undergraduates. Nearly four in five (78.2 per cent) completed two or more internships. At NUS, all fresh dentistry graduates were hired, and nearly all its law and medicine graduates found employment. More than nine in 10 fresh graduates from business, computing and design & environment were employed within six months of completing their final exams. Every graduate from NTU's National Institute of Education found a job. Graduates in accountancy and business also did well, with 97.4 per cent of them having secured jobs. They were followed by graduates in accountancy (97.3 per cent), computer science (94.6 per cent) and information engineering & media (also 94.6 per cent). Not only was the overall mean gross monthly salary among fresh graduates higher than those of the Class of 2015, their median gross monthly salary was higher as well - S$3,360, compared to S$3,300 in 2015. The gross monthly salary comprises a person's basic salary, overtime pay, commissions, fixed allowances and other regular cash payments, before the deduction of CPF contributions and personal income tax. The employer's CPF contributions, bonuses, stock options, other lump sum payments and payments-in-kind are excluded. The survey found that SMU graduates took home the highest pay; they also earned the highest mean and median salaries. Their mean gross monthly salary of S$3,722 was higher than their peers at NUS (S$3,541) and NTU (S$3,424). An SMU graduate's median gross monthly salary was S$3,500 in 2016, more than NUS (S$3,400) and NTU (S$3,300). In SMU, graduates of its information systems course had the most significant increase in starting pay - they pulled off a 6.5 per cent increase over the 2015 cohort, receiving S$3,897 as the mean gross monthly salary. At NUS, two computing courses - computer science and information systems - and electrical engineering had the highest increase in starting salaries. Overall, graduates from 16 NUS courses including arts, business, computing, nursing and pharmacy, recorded improvements in their starting salaries. At NTU, the three courses with the highest mean gross monthly salaries in 2016 were business & computing (S$4,407), accountancy & business (S$3,893), and computer science (S$3,848). The Singapore Institute of Technology and the Singapore University of Technology and Design, which have different academic calendars, will run their surveys in February and March respectively. The full findings of the joint graduate employment survey can be found at www.moe.gov.sg/education/post-secondary."
    },
    {
        "id": "013",
        "title": "Campuses get creative",
        "content": "Universities here have packed arts calendars to spotlight student talents and let them work with international artists. The line-up of artists is impressive. There are international names such as Japanese choreographer Akiko Kitamura and Taiwan's Horse Dance Theatre, as well as prominent local professionals such as multimedia artist Brian Gothong Tan and The T'ang Quartet. Spanning dance, film, theatre and classical music, next month's NUS Arts Festival would give any festival by a professional arts institution a run for its money. Only its name belies the fact that it is organised by the National University of Singapore (NUS) and that most of the events take place at its Kent Ridge campus in Clementi. The arts is thriving in universities here, with the three major tertiary institutions - NUS, the Singapore Management University (SMU) and Nanyang Technological University (NTU) - brandishing packed arts calendars. These year-round arts programmes are accompanied by serious spending, largely from university coffers. For example, the 2.5-week long NUS Arts Festival, which opens on March 14, cost the university a six-figure sum, a budget comparable to that of festivals mounted by professional theatre companies here, such as the M1 Singapore Fringe Festival. The universities say they are investing in the arts to give students an outlet for their talent and engage them intellectually and creatively. However, each institution takes a markedly different approach to arts programming. NUS, for one, pulls out all the stops for its annual arts festival. This year's is the ninth edition and it offers a wide range of events from collaborations between professionals and students to free film screenings and shows by the university's performing arts groups. Ticket prices are relatively affordable compared to shows at downtown arts venues – a top-tier ticket for acts such as opening show Overdrive is $29. The show is choreographed by Kitamura, Israel's Idan Cohen and Horse Dance Theatre and features the NUS dancers and the home-grown T.H.E Second Company. Ms Christine Khor, director of the university's Centre For The Arts, says the festival aims to engage students intellectually as well as expose them to high standards of artistry. “We give our students a process where they can learn from their artistic directors and international practitioners,” she says. The high standard of programming means that out of 23 student groups under the centre's purview, only 11 are putting up shows this year. She adds: “The productions have to be very good because we do have world-class venues and we don't want them wasted.” The University Cultural Centre's hall can seat over 1,700 people, while its theatre seats up to 450. The hall has high-tech features such as 65 fly line sets – comparable to the 47 at the Drama Centre and 103 at the Esplanade – which allow for multiple props to be lowered onto the stage. Home to the Yong Siew Toh Conservatory of Music, the country's only conservatory offering degree-level classical music programmes, the university also boasts a 600-seater concert hall shaped like a rectangular shoebox, with an adjustable roof to change the acoustics of the venue. Aside from the annual festival, the university also hosts the ExxonMobil Campus Concerts series, sponsored by the oil and gas company, which puts up about 20 free shows a year. There is also the NUS Museum, a 10,000 sq ft facility at Kent Ridge which houses the university's collection of more than 7,000 artefacts and artworks. While the NUS has consolidated the bulk of its arts events in one festival, the SMU has headed in the other direction, spending about a quarter of a million dollars on year-round arts programmes. Since 2011, the university has decided to forgo a single festival for performances spread throughout the academic semesters. Mr Jimmy Ye, head of arts and student life events at SMU, says its programming is focused on putting students in the spotlight and having students work closely with arts practitioners who can advise them artistically. SMU's arts festival started as a one-day affair in 2005 and grew into a three-week season in 2010. However, its rapid growth also ran up against the university's compact size and downtown location at Stamford Road. Mr Ye says: “When we built it up to a three-week event, we had a severe venue crunch. We didn't have the money to hire external venues and we didn't have enough internal venues. All the groups were fighting for Friday, Saturday or Sunday slots.” He says the SMU organisers “decided to think out of the box” and canned the idea of a single, consolidated arts festival. Now, it has concerts from its 26 performing arts groups spread out over the two semesters. He adds that the programmes place “the students at the forefront of all the performances.” SMU's performing arts groups still work with external artists. In 2009, actor Sebastian Tan, best known as Broadway Beng for helming the long-running eponymous revue, directed a musical for the university. Singapore Chinese Orchestra's resident conductor Quek Ling Kiong also lends his baton to SMU's Chinese orchestra group. The NTU's arts programming is also very student-driven. Its performing arts shows are focused more on pop culture, with accessibility being the buzzword to engage its students. Its annual ongoing Nanyang Arts Festival, which opened on Feb 6 and runs till March 13 at the Jurong campus, is largely organised by the university's Cultural Activities Club and is now in its 23rd year. Club president Joel Lim, 22, says of the festival: “It is not run from the top down, but instead, from the bottom up. One advantage of this is that ideas can be shared among ourselves more easily, without having to go all the way up.” The club helps to manage concerts for NTU's 22 performing arts groups. For the festival, it organised programmes such as film appreciation and print-making workshops. The club receives between $20,000 and $30,000 a year from the university to run all its programmes. On the emphasis on accessibility – the festival also includes busking performances and terrarium-making workshops – Mr Tan Dian Feng, 22, vice-president of events management at the club says: “Not everyone has a liking for the arts and we need something to spark off that interest.” In the area of the visual arts, the university has a major off-site initiative, the Centre for Contemporary Art (CCA) at the Gillman Barracks gallery cluster off Alexandra Road. The centre, developed with support from the Economic Development Board, opened in October last year. It is an art and research hub which also holds exhibitions and offers residencies to international artists. The centre's director, Professor Ute Meta Bauer, says: “Education is at the core of NTU – CCA's programme. Through our programme of exhibitions, public events, residencies and research, we would like to engage NTU students with the complexities of cultural production in a global world.” Aside from the centre, the university also has a School of Art, Design and Media, offering degree-level visual arts courses. It houses two 200 sq m galleries that hold curated exhibitions of works by local and foreign artists. Professor Vibeke Sorensen, chair of the school, says: “The gallery's exhibitions intend to provide opportunities for primary access to works of art to stimulate discussions among artists, scholars and students. It also aims to stimulate curiosity for art, design and media in students, faculty, academic and professional colleagues as well as the public.” Needless to say, arts-loving undergraduates have never had it so good. Being in SMU has given accountancy student Seah Yi Ru, 20, president of the university's Chinese orchestra, the chance to be exposed to the arts as both a performer and an audience member. She says: “Being in the orchestra has taught me that I need to be disciplined to practise and it also helps us build teamwork as we have to support each other in terms of music and organisation.” She watches the concerts of other performing arts groups regularly and is glad for the exposure. “There's a large variety of art forms, including theatre, photography and dance, and for every art form, there are a number of groups doing it so the scene is very diverse,” she adds. “I think the people here are very creative because we're always encouraged to come up with new ideas and to stand out from the rest.”"
    },
    {
        "id": "014",
        "title": "Six local universities offer course on imagining Singapore's future",
        "content": "For the first time, the six publicly-funded local universities have one common course for all their undergraduates. \"Singapore: Imagining the next 50 years\" is being taught at Nanyang Technological University (NTU), National University of Singapore (NUS), Singapore Institute of Technology (SIT), Singapore Management University (SMU), Singapore University of Social Sciences (SUSS) and Singapore University of Technology and Design (SUTD). As part of the course, students get to discuss issues affecting Singapore and its future, including the economy and social integration. The presidents of the six universities formed a working group in the Educational Institutions Council under a Ministry of Defence advisory body, to jointly come up with the idea for the course. Professor Cheong Hee Kiat, president of SUSS, said the idea was to build upon National Education. \"It is an opportunity for mutual learning and working together. A kind of Singapore University Inc, where we can join forces and share pedagogy and expertise.\" The course content will be constantly updated. \"What is being discussed now is this thing about fake news. Over time, as this fake news issue pans out and the Government passes laws, we will update the course materials,\" he added. NTU, NUS, SIT and SMU launched the course in January last year, while SUSS and SUTD launched it in the second half of the year. The course has been popular with students. In SUTD, there were six times as many applicants as vacancies. This has led some universities to increase the enrolment or frequency of the course. NTU had 36 places for the course in its first semester, but expanded this to 300 places for each semester this year. At SIT, the original quota of 103 will go up this year to 275. Dr Nazry Bahrawi, a lecturer at SUTD's Humanities, Arts and Social Sciences cluster, developed the content for one section of the course. A key concern for those designing the course was that it should be seen as objective and not pushing a certain viewpoint, he said. \"For example when discussing utopia, I sought insights from government institutions such as the Urban Redevelopment Authority, but I also got people from civil society to give their inputs,\" he said. Students are encouraged to disagree with one another, as it helps them \"think critically and make informed judgments\", he added. Third-year accountancy student Caley Tan, 22, of the Nanyang Business School at NTU, took the course last year and enjoyed it as it provided students \"an open space to discuss issues\". It was also the first time she had taken a module focused specifically on Singapore. \"It is relevant because whatever degree you are pursuing, it is important to know about the state of things here,\" she said."
    },
    {
        "id": "015",
        "title": "Beyond A levels; What's new at the six",
        "content": "New degree programmes, curriculum changes, and a common course - all these at Singapore's six universities in the coming academic year. All six universities are offering a common course for the first time. Named Singapore: Imagining the Next 50 Years, the course aims to help students understand the socio-economic challenges that Singapore grapples with. It also seeks to promote creative thinking in seeking solutions to these challenges. Launched last month at the National University of Singapore (NUS), Nanyang Technological University (NTU), Singapore Management University (SMU) and Singapore Institute of Technology (SIT), the course will be offered at the Singapore University of Technology and Design (SUTD) and SIM University (UniSIM) in the second half of this year.\n\nNUS: Prospective students can opt for direct admission to about 70 new double major or major-minor combinations in 16 subject areas. The School of Computing revamped its information systems degree programme to better serve industry needs. The first two years will focus on enterprise architecture and systems, while the final years offer specialisations in fintech, digital innovation, or e-commerce.\n\nNTU: Students at the College of Humanities and Social Sciences may select courses from other disciplines. New minors include Film Studies, Global Asia, and Urban and Environmental Studies. A cross-disciplinary minor in Science, Technology and Society is also introduced. The School of Art, Design and Media will offer a refreshed curriculum.\n\nSMU: A new major in smart city management & technology will be offered. The information systems degree programme is revised to focus on IT solutions for business and social value, with specialisations in fintech and cognitive systems. Students may pursue integrated master’s programmes.\n\nSUTD: The new SUTD Technology Entrepreneurship Programme (Step) offers a 4.5-year integrated bachelor’s and master’s degree. It includes international exposure in the US and China, and a final-year capstone project and dissertation. Admission includes a 300-word essay and interview.\n\nSIT: SIT will offer a new civil engineering degree and convert six existing programmes into joint degrees with Newcastle University. These joint programmes will include the Integrated Work Study Programme. SIT also partners with Glasgow, Trinity College Dublin, and DigiPen, offering 11 joint degrees in total. SkillsFuture work-study degrees will also be available in several fields.\n\nUniSIM: Two new full-time degrees are offered—early childhood education and business analytics. The early childhood course includes a year of fieldwork. The school also introduces an apprenticeship programme in finance and business analytics in collaboration with 12 industry partners who co-develop and co-deliver the programmes and participate in student admissions."
    },
    {
        "id": "016",
        "title": "More varsity students heading overseas for internships",
        "content": "Those with overseas experience 'stand out naturally' during interviews: PR agency exec. While many of his peers remained in Singapore for their internships, Mr Tan Rui Feng, 24, packed his bags and left for Uganda. The third-year business and social science student from Singapore Management University (SMU) had spotted a sales and marketing internship opening there on his school's career portal, and decided to give it a shot. He spent 10 weeks from May last year at a consumer goods firm, where he learnt its manufacturing processes and how to tackle issues faced by its retailers and sales partners.\n\nLike Mr Tan, more students from local universities are venturing beyond Singapore for their internship stints. This includes his university, which has seen about 150 to 250 SMU students going for overseas internships annually in the last five years. In the past three academic years, the National University of Singapore (NUS) saw an average year-on-year increase of about 22 per cent in the number of overseas internships completed. Last academic year - between August 2016 and July 2017 - NUS students completed close to 490 internships in over 40 countries, said the university's senior vice-provost for undergraduate education, Professor Bernard Tan.\n\nOverseas stints provide students with the chance to \"develop a global perspective and mindset, while at the same time increase their confidence in interacting with people from diverse cultures and nationalities\", he added. Nanyang Technological University (NTU) also saw a 13 per cent increase last academic year in students heading overseas for internships, compared with four years ago. In the last three academic years, an average of 165 students went abroad annually for internships and work attachments that count towards their graduation, said the school's deputy provost for education, Professor Kam Chan Hin.\n\nAt Singapore University of Technology and Design, the number of students with overseas internship experience increased by 4 per cent from last year. They visited countries including Brazil, Cambodia, Portugal, Vietnam and Sri Lanka. While students face challenges when they go abroad, they can also develop and demonstrate qualities like resilience, independence and risk-taking - qualities desired by many employers, said Mr Sim Cher Young, director of SMU's Dato' Kho Hui Meng Career Centre.\n\nMr Ethan Tan, director of public relations agency Tate Anzur, said that while the firm does not actively seek candidates with overseas experience, it notices that those who have it are \"more vivacious and more daring with their perspectives during interviews\". He added: \"That made them stand out naturally.\"\n\nThis year, the Singapore Institute of Technology (SIT), which began offering its own degree programmes in 2014, launched an Overseas Integrated Work Study Programme, which provides students the option of completing their compulsory work attachment overseas. The programme's pilot rollout is only available to students from the hospitality business course, but there are plans to extend it to other degree programmes. The university estimates that it will eventually see a 30 per cent participation rate annually in eligible cohorts.\n\nFinal-year SIT hospitality business student Roy Lim decided to spend his eight-month internship at a professional conference organiser in Taiwan. \"I wanted to experience something beyond my comfort zone, validate and strengthen my knowledge of the Mice (meetings, incentives, conferences and exhibitions) industry and improve my Mandarin,\" said Mr Lim, 25. He added that the experience allowed him to \"immerse himself and adapt to a vastly different culture\", and also helped to improve his command of his mother tongue.\n\nMs Tan Shu Yu, 23, said working in an international environment was a valuable experience she took away from her internship in Paris, where she worked at a petrochemical multinational corporation. The final-year renaissance engineering programme student from NTU, who was the only Singaporean in her department, said: \"I found it very interesting and insightful to interact with my fellow colleagues as their experiences were vastly different from mine, and thus we had quite different perspectives of things.\""
    },
    {
        "id": "017",
        "title": "Local unis in step with teaching in changing times",
        "content": "They are providing new degree options, making more use of technology in classrooms. Universities that offer established degree courses - such as law, medicine and engineering - review them constantly to keep them relevant and attractive.\n\nIn Singapore's changing higher education landscape, a greater variety of degree options has been offered in the past few years. This is to cater to a wider range of interests among students looking to further their education.\n\nUniversities contacted said adjustments made to their established degree offerings include strengthening alumni networks, boosting opportunities for global exposure, attracting professors from top institutions and tapping on technology and progressive teaching methods.\n\nThe two existing law schools - at the National University of Singapore (NUS) and the Singapore Management University (SMU) - for instance, already offer sought-after law degrees. Law courses typically take in top A-level students, or polytechnic graduates with perfect or near-perfect grade point averages.\n\nBut next year, another tertiary institution, SIM University (UniSIM), will start a law school here.\n\nThe NUS law faculty, widely regarded as Asia's leader, has close to 60 years of history.\n\nIts dean, Professor Simon Chesterman, said the network students build at his school will hold them in good stead throughout their legal careers. \"For them, the friends and mentors they work with at law school will go on to be their colleagues,\" he said.\n\nThe SMU School of Law, which took in its first batch of students in 2007, may not have as much history as NUS. To attract students and adapt to their learning styles today, it uses creative tools, such as animation and games, in the classrooms.\n\nFor a course on criminal law, for instance, an animation tool was developed to re-enact a real murder case in Singapore. At certain points during the animation, questions pertaining to the case are displayed and students are prompted to visit a forum to discuss relevant concepts.\n\nThe animation, which tracks students' learning progress via the completed scenes, requires them to review their course materials during and outside class.\n\nAssociate Professor Tan Swee Liang, director at SMU's Centre for Teaching Excellence, said: \"In an age dominated by technology and social media, we have to think beyond the traditional instructional methods to cater to the new generation of learners.\"\n\n\"For the law discipline, these tools can help to demystify complex contexts and make it easy for students to comprehend them, and make learning engaging and interactive.\"\n\nUniSIM said its School of Law will also tap on technology, by using a blended learning approach, which includes e-learning as well as classes conducted in the evenings and weekends.\n\nIn medicine, another field of study leading to a degree, students can now turn to Singapore's latest medical institution, the Lee Kong Chian School of Medicine. This school, which opened its doors in 2013, was set up by the Nanyang Technological University (NTU) and Imperial College London, which is ranked highly for its medical degree.\n\nProfessor Kam Chan Hin, deputy provost for education at NTU, said students are getting a \"rigorous curriculum\". \"The learning pedagogy is innovative, with no lectures, and team-based learning,\" he said.\n\n\"Online learning materials, early exposure to patients from year one, and simulation training using actors are all part of the learning.\"\n\nFor decades, the NUS Yong Loo Lin School of Medicine, started in 1905, was the only medical school for undergraduates here. Another medical school here, the Duke-NUS Medical School, was established by Duke University in the United States and NUS about 10 years ago to train graduate students.\n\nThe Yong Loo Lin school's dean, Associate Professor Yeoh Khay Guan, said it refines the curriculum to keep pace with new healthcare challenges, such as meeting the needs of an ageing population. The school recently expanded its geriatric medicine module to prepare students to better care for the rising number of older people here.\n\nIt has also introduced simulation training that tests and trains medical students to work on realistic clinical situations as a team.\n\nNUS is also revamping its engineering curriculum to get undergraduates excited about the profession and the diverse career paths they can pursue - from research and development to entrepreneurship. For instance, students will get to take new hands-on modules early in their studies.\n\nBesides training students for chosen fields in engineering, from mechanical to environmental, NUS will open up specialisation tracks for students in research and development, and in the design and innovation aspects of engineering.\n\nAt NTU, which counts engineering among its strengths, programmes are also updated to meet the future needs of the workforce. Increasingly, its courses allow students to pursue areas beyond their core discipline of study. For instance, a popular programme is renaissance engineering, where students study disciplines such as engineering, business and liberal arts.\n\nProf Kam said: \"In the new global workplace, many problems require interdisciplinary solutions. Today's work challenges go beyond any single field.\""
    },
    {
        "id": "018",
        "title": "Fintech push leads to pay surge for some fresh grads",
        "content": "Highest jump of 33% rise for NTU grads with business and computing double degree: Survey. With the rise of technologies for making financial transactions better, and Singapore's push to become a more connected nation, graduates of a double degree programme here have enjoyed a big jump in pay.\n\nGraduates from Nanyang Technological University's (NTU's) business and computing double degree programme had the highest pay jump last year among their peers - they took home a gross median monthly salary of $4,583, a 33 per cent pay increase compared to their seniors who graduated in 2014.\n\nThis put their salaries almost on a par with those who studied law or medicine at other universities, who earned between $4,700 and $4,900, according to a survey of full-time, fresh graduates released last Wednesday.\n\nThe survey involved graduates from the National University of Singapore (NUS), NTU and the Singapore Management University.\n\nAlmost half of the more than 30 graduates from NTU's business and computing course went to the financial and insurance industry, a spokesman told The Straits Times.\n\nBanks said the \"fintech revolution\" sweeping the world makes combined degrees for business and computing valuable. (Fintech refers to financial technology, in which technology is applied to financial services - such as mobile payments and money transfers - to make them more efficient.)\n\nA business and computing double degree can help graduates to \"quickly understand how and where technology can improve the financial services that institutions provide to clients\", said head of campus recruitment at Credit Suisse Asia Pacific Nikki Davies.\n\nMr Malcolm Harrow, senior technology officer for Singapore and South East Asia at JP Morgan, said that graduates from computer-based courses \"will have sufficient know-how to link technology to business processes as well as have strong problem solving skills\".\n\nTechnology and recruitment experts added that the country's smart nation initiative, which envisions the use of technology to make daily living more convenient, may have increased the need for graduates with specialised IT skills. The initiative was launched by Prime Minister Lee Hsien Loong last year.\n\nSaid Ms Linda Teo, country manager of recruitment firm ManpowerGroup Singapore: \"As the nation moves up the value chain, the demand for complex technology and services to support such changes creates the demand for dual-degree and combined-skills graduates.\"\n\nAnd the gaps in the industry that need to be filled, said Ms Shirley Wong, chairman of the Singapore infocomm Technology Federation, include the areas of data analytics and cyber security.\n\nA shortage in graduates here with business and computing skills could have allowed them to command higher salaries too.\n\nMr Alvin Ang, who runs recruitment firm Quantum Leap Career Consultancy, said this is partly due to the difficulty in hiring foreigners for the sector, after government efforts to curb foreign labour.\n\nThe demand for IT expertise also meant that fresh graduates of NUS' computer engineering programme, which typically enrols 100 to 120 students, also enjoyed higher salaries - their pay was up 14.3 per cent from last year to hit $4,000.\n\nMr Joel Quek, 26, who is currently working as a tech analyst in a multinational bank, said that doing a double degree in business and computing at NTU gave him an edge.\n\n\"If not for my business modules, I might not have even thought of joining the finance industry. So, doing this double degree opened my mind and my options,\" he said."
    },
    {
        "id": "019",
        "title": "Uni students gun for overseas stints",
        "content": "OPTIONAL overseas exchange programmes have become a way for undergraduates to gild their resumes. They see them as investments, and pay up to tens of thousands for the experience. Universities say the yen for global exposure has sharply increased in the last decade.\n\nAmong their 2011/2012 graduating cohorts alone, the National University of Singapore (NUS), Singapore Management University (SMU) and Nanyang Technological University (NTU) say that at least half have been on at least one trip. Eventually, they aim to have all undergraduates attend at least one exchange.\n\nSuch programmes are offered across all disciplines, and can last two weeks to more than six months. To qualify, students usually have to meet grade requirements, and some have to go through an interview.\n\nSMU's director at the Office of Global Learning, Ms Bernadette Toh, said employers regard graduates with overseas stints as \"less parochial, more broad-minded, resourceful and sensitive to intercultural issues\", driving demand for these stints.\n\nThe most desired placements - in North America, Sweden and western Europe, especially Britain - are also the most expensive compared to those in Asian universities, which cost at least 20 per cent less.\n\nTo pay for these trips, students apply for loans, bursaries or grants. At SMU, up to 10 per cent receive scholarships or awards worth between $4,000 and $9,000. Another 15 to 20 per cent get loans up to $11,500, or subsidies of $500 per trip. Universities generally facilitate loans from local banks.\n\nMr Keefe Tan, 26, took a bank loan of $11,500 to fund multiple stays - two semester-long stints in Mexico and Poland, an internship in India and a community service trip to Thailand. The recent graduate of SMU's School of Information Systems reasoned: \"You can borrow money but you can't borrow time.\"\n\nTuition costs the same as for local courses. But students rack up bills for meals, living expenses, rent and additional travel.\n\nMr Leow Tien Leng, 22, an NTU mathematics undergraduate, spent $20,000 during his exchange last year to Stockholm University in Sweden. He used up his scholarship stipend and wiped out his savings - spending half his funds on vacations.\n\nFortunate ones like Mr Evan Lee, 24, have help from parents. The third-year NUS arts and social sciences major spent up to $25,000 over six months attending Ottawa University in Canada last year, when he also toured at least six cities in North America.\n\nFor substantially less money, some choose universities in Russia, Brazil and Kazakhstan, which can cost less than half of those in Germany or the United States. Said SMU business graduate Tricia Tan, 24, who spent her $8,000 grant on a stint in Kazakhstan and an internship in India: \"The two places were very affordable.\"\n\nOthers stick to shorter, summer exchanges or stints at Asian universities. Professor Tan Kang Hai, director of NTU's Office of Global Education and Mobility, pointed out: \"A South Korean university can offer a similar course to that of University of California, Berkeley, at one-third the price. Plus, South Korea offers add-ons like cultural immersion, so why not?\"\n\nHuman resource professionals, however, say it is not the destination, but what a student has gained that gives him an edge.\n\nSingapore Human Resource Institute president Erman Tan said that while exchange programmes could teach undergraduates to be more adaptable and resourceful, \"you must be able to relate that experience to work, and how you can help the company to grow\". He added: \"If you can show how it has helped you, then it will score some points.\""
    },
    {
        "id": "020",
        "title": "Undergrads' top priority: Work-life balance",
        "content": "EVEN before entering the workforce, university students here are sure of one thing they want from their careers: a work-life balance. It came out as the top motivating factor in a survey of 6,000 undergraduates, beating job security into second place and dedication to a cause in third.\n\nTo be challenged competitively or intellectually was only fourth on the list while being a leader or manager was fifth. Employer branding consultancy Universum got university students to pick their most important career goals out of a list of nine.\n\nIn sixth was to have an international career, in seventh was to be entrepreneurial and creative, in eighth was to be autonomous or independent and last was to be a technical or functional expert.\n\nMost students who took part in the online survey were from the National University of Singapore, Nanyang Technological University, Singapore Management University and the Singapore Institute of Management. The survey was carried out between last December and May.\n\nHuman resource experts interviewed said the survey's results explain why many young people have no qualms about taking unpaid leave or \"job hopping\".\n\nMr David Ang, associate director of human resource consultancy Remuneration Data Specialists, said: \"Younger workers do not want to compromise their private life for work. If they cannot find that, they will leave.\"\n\nUniversity students and fresh graduates interviewed said personal interests come first for them as they do not have to worry about supporting their parents - most of whom are financially independent.\n\nHuman resource experts said companies need to do more to design staff retention policies that fit the interests of young workers.\n\nMr Josh Goh, assistant director for corporate services for recruitment company The GMP Group, suggested that more firms should look at allowing staff members to go on unpaid leave to travel or pursue their own goals and fund courses to further their studies.\n\nFresh graduate Alice Zhao, 23, said employers should promote a culture of \"working with friends\" - as is the case with her employer, a technology company. \"We are trusted to work from home. We also socialise over the meals which are provided. It doesn't feel like we are working because we are enjoying ourselves,\" she said."
    },
    {
        "id": "021",
        "title": "Broad-based curriculum a key feature of some universities in Singapore",
        "content": "Such interdisciplinary education helps grads be more flexible, say recruitment experts. Several universities in Singapore already have courses that straddle disciplines in a bid to offer undergraduates a broad-based education, experts said. In particular, tertiary institutions with curricula influenced by the US model allow students to break out of silos such as purely humanities or hard sciences courses, said National Institute of Education don Jason Tan. These institutions include the Singapore University of Technology and Design (SUTD), Yale-NUS College and Singapore Management University (SMU). For instance, despite its focus on technology, SUTD requires students to take courses in the humanities and social sciences, Associate Professor Tan said. And Nanyang Technological University (NTU) offers courses that allow students to combine subjects from different specialised fields, such as engineering and business. On Wednesday, The Straits Times reported that the National University of Singapore (NUS) plans to bring together its Faculty of Arts and Social Sciences and Faculty of Science to form a College of Humanities and Sciences. If these plans are approved by the authorities, the college could begin accepting students next August, for the next academic year. Students will be able to take courses across disciplines before choosing a specialisation. They will also have access to facilities and courses in both the NUS faculties, which will still exist. This will allow students to embrace disciplines across the humanities, social sciences, science and mathematics. Experts said the move by NUS follows in the footsteps of universities in Singapore and abroad that adopt a broad-based or liberal arts approach popular in the United States. For instance, a key feature at Yale-NUS College is a common curriculum. All students take modules such as quantitative reasoning, scientific inquiry and modern social thought. Prof Tan said the move by NUS indicates that it recognises that old ways of teaching and learning may no longer be enough. \"However, it is harder to dismantle long-established structures than to start something brand-new, which is an advantage the younger universities have.\" URGENT NEED FOR CHANGE: It is harder to dismantle long-established structures than to start something brand-new, which is an advantage the younger universities have. The fact that NUS is doing this now shows that they see the urgent need to move in the direction of broad-based learning. - NATIONAL INSTITUTE OF EDUCATION DON JASON TAN, on the National University of Singapore's plans to bring together the Faculty of Arts and Social Sciences and Faculty of Science to form a College of Humanities and Sciences. BALANCED PERSPECTIVES: This should result in graduates with more balanced perspectives, which can help them address global issues differently. - MR DAVID LEONG, managing director of human resource consultancy PeopleWorldwide Consulting, saying the larger college planned by NUS should promote flexible study combinations. Popular double major combinations at NUS: To broaden their knowledge, students at the National University of Singapore (NUS) can currently take a second major from a range of 35 disciplines. These disciplines span different fields, from business analytics and geography to food science and mathematics. An NUS spokesman said popular double major combinations among undergraduates currently at the Faculty of Arts and Social Sciences and the Faculty of Science include: • Life sciences and psychology • Applied mathematics and economics • Economics and statistics • Economics and mathematics. She added that examples of contrasting double majors that current students have opted for include: • Sociology and life sciences • Data science and sociology • Environmental science and philosophy. \"The fact that NUS is doing this now shows that they see the urgent need to move in the direction of broad-based learning.\" An NUS spokesman said the new college \"will feature some elements of a US liberal arts education\". The common curriculum to be developed will draw on the strengths of both existing faculties, whose departments \"have built a strong reputation for academic and research excellence\" over the years, she added. She said: \"NUS has had successful experiences with delivering interdisciplinary studies in smaller settings, such as the University Scholars Programme, Residential College Programmes and Special Programme in Science.\" NUS now wants to expand this model through the new college to benefit more students, she added. NTU had earlier announced plans for a common core curriculum for all undergraduates entering next August - except for those in its medical school. The modules, which will take up a fifth of the academic workload, are meant to enable students to integrate knowledge across disciplines and develop skills in communication, digital literacy, enterprise and innovation, among others, NTU said. Professor Tan Ooi Kiang, NTU's deputy provost for education, said the university has interdisciplinary programmes such as the Renaissance Engineering Programme, which blends engineering with business and humanities. SMU provost Timothy Clark said its undergraduate curriculum already offers a high level of flexibility. \"Our students may enrol for courses across schools regardless of the degree programme they are enrolled in,\" he said. Most SMU students graduate with a second major, a second degree, or both. Professor Clark said SMU has common core modules that form 33 per cent of its undergraduate curriculum, and the university has also launched initiatives for students to work in multidisciplinary teams to address actual industry problems. Recruitment experts said having both specialised and soft skills is necessary in today's job market. They added that an interdisciplinary education can help graduates be more flexible and open-minded as they solve real-world problems. Mr David Leong, managing director of human resource consultancy PeopleWorldwide Consulting, said the larger college planned by NUS should promote flexible study combinations of humanities and sciences. \"This should result in graduates with more balanced perspectives, which can help them address global issues differently,\" he said. Mr Vinay Dua, managing director of recruitment firm CareerBuilder Singapore, said employers are increasingly looking out for skills and aptitude over qualifications. \"A person with a diverse or interdisciplinary education offers more chances for him to experiment in his career,\" he said."
    },
    {
        "id": "022",
        "title": "Undergrads scramble for internships amid hiring freeze",
        "content": "Universities monitoring impact of pandemic on opportunities, helping to secure remote work options. Ms Yasmin Suhaimi was all set to head to Bangkok to start her first internship in May with a venture capital firm. But in March, the second-year business student from Singapore Management University (SMU) learnt that the offer had been withdrawn because of the Covid-19 outbreak. She is one of many students in Singapore who scrambled for internships when firms' hiring came to a halt, as work for interns has been put on the back burner. Ms Yasmin, 21, eventually landed a remote internship with Get All, a microservice provider that supports small businesses overseas. She secured the spot through SMU's Institute of Innovation and Entrepreneurship's Global Innovation Immersion, which matches aspiring student-entrepreneurs with firms worldwide. \"I was very excited to go overseas, so it was a bit disappointing. But I'm also very relieved to secure another internship,\" she said. Data from job portals this year has shown a drop in internships. For instance, JobsCentral and BrightMinds had 222 internship and part-time positions listed from January to May, down from 348 last year during the same period. Mr Vinay Dua, managing director of the job portals' parent company, CareerBuilder Singapore, noted a \"significant dip\" in internships related to wealth management and financial planning, sales and consulting. \"This is unsurprising, given the reduction in demand for those services amid the pandemic,\" he told The Sunday Times. A wider availability of talent to take on short-term projects and part-time jobs affects internship opportunities, he pointed out, as internships are usually created by firms for such ad hoc work, without them having to hire full-timers. Mr David Leong, managing director of human resources firm PeopleWorldwide Consulting, said: \"In 'peacetime recruitment', interns can be enlisted to help organisations and employers, and be immersed in the actual work context for immersive learning and experience. But such an experience is hard with the work-from-home arrangements now. There is a lot of work rebalancing and reallocation of resources for employers, and enrolling interns is the last thing on their agenda.\" But there is value in hiring interns even during this period, said Mr Leong, as they can be an asset for small and medium-sized enterprises (SMEs) in their digitalisation efforts, which have been accelerated by the Covid-19 situation. The universities are monitoring the impact of the pandemic on work opportunities. Ms Joan Tay, director of the Centre for Future-ready Graduates at the National University of Singapore (NUS), said it anticipates that sectors like retail and hospitality, transport and aerospace, as well as SMEs will be most affected. But internships are still available in sectors such as information and communications technology and healthcare. NUS placed over 7,000 students on internships in its current academic year which started last August, similar to the figures in previous years. It has made arrangements for all affected students, including those whose stints were withdrawn, so that none of them will face a delay in graduation, Ms Tay said. This includes working with employers to modify the scope and duration of work so that students may telecommute, and helping students source alternative options. NUS is also seeking remote internships with overseas partners, and several in countries such as Chile, China and Switzerland have started to offer such positions. A spokesman for Nanyang Technological University (NTU) said it is also exploring remote internships with companies based overseas. It recently inked a partnership that has opened up nearly 200 such positions with about 100 companies in Chongqing, China. More than 200 students have applied for these stints, which will begin in the new academic year. To support students, NTU also offers a programme akin to an internship, which allows them to work on real-life team projects and address the business needs of companies. They are mentored by staff from companies as well as faculty members. \"The supervision load on the company personnel is lower compared with an internship, which makes it more attractive for companies to take part in,\" said the spokesman. The number of NTU students on internships has remained stable this academic year, compared with the year before, he said. Mr Sim Cher Young, director of SMU's Dato' Kho Hui Meng Career Centre, said it has seen fewer internship postings from companies this summer break. SMU has also reached out to students whose internships have been cancelled, postponed or shortened, to help them find alternative hosts. \"To support this group, we have also welcomed companies with shorter projects and research activities to come on board our internship programmes,\" said Mr Sim. Ms Huo Yasi, senior assistant director of SMU's Institute of Innovation and Entrepreneurship, said its plans for at least 60 students to go overseas for summer internships were suspended owing to Covid-19. Some firms were able to proceed with the stints on a remote basis, while others could not. \"Students have been resourceful enough to find their own internships, and we've also sourced positions from start-ups within the SMU community,\" said Ms Huo. Mr Leon Qiu, chief executive of Get All, said he had hoped at least eight interns this year could work in Shenzhen and Yangon, where its overseas offices are based. But the outbreak has caused him to scale down his plans. He now has four interns who are working from home in Singapore. He said that although a remote internship would not be \"as impactful\" as an immersive one that would have included trips to villages in Myanmar where the firm provides micro-loans, he \"didn't think it was fair to cancel on the interns\". Second-year SMU business student Hoo Xuan Ting, 21, had plans to be in the heart of San Francisco's business district on an internship with Going Merry, an education management technology company. Since May, she has been working for the firm, but mostly from her bedroom in Singapore. \"I was concerned about whether I could learn from the company and how much I could take away from working remotely, but it's been a good experience,\" she said. \"I try to be proactive and solve problems on my own, while being efficient with the use of my time.\""
    },
    {
        "id": "023",
        "title": "NUS and NTU are top universities in Asia in QS world university rankings",
        "content": "SINGAPORE - The National University of Singapore (NUS) and Nanyang Technological University (NTU) have emerged as the top universities in Asia based on global rankings by subjects. Singapore has 23 university courses - 16 from NUS and seven from NTU - that made it to the global top 10 lists of the Britain-based Quacquarelli Symonds (QS) World University Rankings by subject. The rankings were released on Wednesday (April 6). The QS lists are based on a survey of 1,543 universities of which 376 universities are in Asia, taking into account areas such as academic reputation, standing with employers, faculty-to-student ratios and citations per faculty. Singapore ranked higher than Hong Kong, which has seven courses in the top 10 lists, China has four, and Japan, three. According to the QS rankings, Singapore has the best higher education system in Asia, based on the Republic's share of programmes in the top 10 global lists. In Asia, the Republic's top spot is followed by Hong Kong, China and Japan. Globally, Singapore has the fourth-best higher education system in the world, after the United States, Britain and Switzerland. NUS and NTU stand out in engineering education and research. The QS rankings placed NUS' petroleum engineering programme in the top spot, a position it also attained last year out of 151 contenders. Five other engineering programmes in Singapore were among the global top 10, including chemical engineering, where NUS is ranked third, and NTU seventh. Some degree courses made significant jumps in the rankings. NUS' anthropology course shot up from 14th in 2021 to 10th place this year, while the linguistic programme at NUS jumped from 17th to 10th. Singapore Management University (SMU) broke into the top 100 for the study of law compared with last year. Meanwhile, SMU also rose two places to rank 36th for business and management studies. \"The consistent improvements made by Singaporean institutions in our rankings result from a decade of investment and strategising,\" said Mr Ben Sowter, research director at QS. \"It was in 2010 after all, that the Singaporean Government inaugurated the Singapore Universities Fund, with a view to avoiding the sort of downturn-driven... funding cuts that have beleaguered universities across the world.\" More On This Topic: NUS retains 24th place in latest global university rankings; NTU slips to lower band. NUS climbs to 21st place and NTU moves to 46th in latest global rankings."
    },
    {
        "id": "024",
        "title": "In-person university orientation activities return after two years of Covid-19 curbs",
        "content": "SINGAPORE - Orientation programmes for university students are making a comeback after a two-year hiatus, with most schools adopting in-person and virtual segments. All six autonomous universities here told The Straits Times that they will have in-person activities on campus, after Covid-19 restrictions were eased this year. At the National University of Singapore (NUS), orientation camps organised by the student union, halls of residence and various faculties, among other groups, began two weeks ago. Rag and Flag - an annual event which sees students perform to raise money for charity - will take on an in-person format this year. Nanyang Technological University (NTU) will have some virtual orientation activities to allow those unable to physically attend to participate. The Singapore Management University (SMU), Singapore University of Social Sciences and Singapore Institute of Technology (SIT) will have physical orientation activities in July and August, with SIT hosting exclusively in-person events. The Singapore University of Technology and Design, which had in-person orientation activities in small group settings over the past two years, will have its orientation in September. Pre-pandemic, thousands of freshmen entering university would often participate in residential camps. However, orientation camps in 2020 and last year were largely virtual and muted affairs, owing to Covid-19 restrictions on group sizes and gatherings. The return of in-person activities has been welcomed by students. Third-year student Ryanne Han, 20, who is in charge of games and logistics for NUS Life Sciences Camp, said: \"In a physical camp, there's a sense of community that cannot be replicated online. It is something that I'm really looking forward to this year.\" Mr Donovan Lim, 20, an incoming freshman who took part in NUS' King Edward VII Hall's engagement camp on June 1 and 2, said it left him with a better understanding of hall life and university life as a whole. \"A lot of the tips or advice that seniors gave me was when we were having organic conversations, which could not have happened in a virtual camp,\" he added. For incoming SMU social science freshman Emma Ho, 19, an in-person event will make it easier for her to get to know her peers. She noted that conversations feel more natural in a face-to-face setting than through an online platform. Similarly, NTU-bound Jolene Chia, 19, said: \"You can't feel the vibe of the different co-curricular activities online - you need to be there to find the people and environment which will suit you the best.\" But there are some, like 19-year-old Aman Zainal, who prefer a virtual camp. \"The large groups will tire me out quickly, as I'm someone who is more introverted,\" he said. The chemical engineering major, who will be entering NUS this year, added that the fast-paced orientation programmes require a lot of interaction within a very short period of time. He prefers to get to know his peers gradually over the course of a semester. For the organisers, the relaxation of rules will give their programmes an extra buzz. Student Edmund Ong said the organising committee of the NUS Business Camp had to plan for both online and in-person scenarios in the light of changing Covid-19 restrictions over the past 10 months of planning. The 22-year-old said he is relieved by the return of face-to-face orientation, adding: \"We felt that an online event would not give freshmen the full experience, and lacked the excitement and fun we wanted them to have.\" However, it is not all fun and games in orientation this year. Some students who have already attended camps noticed that orientation activities were being conducted with extra precautions over concerns that the camps could be cut short or called off by the school administration - either over safe management measures being breached or over other forms of misbehaviour."
    },
    {
        "id": "025",
        "title": "Singapore's top students gunning for courses in hot sectors of analytics, food science and environment",
        "content": "Accountancy and chemical engineering no longer the preferred tracks at local universities. INDICATIVE grade profiles at local universities suggest that Singapore's brightest young minds have had a change of heart in their preferred education or career track, and are choosing courses that will lead to hot jobs in fields such as data science and environmental sustainability. An analysis by The Business Times found recent batches of students less inclined than before towards accountancy, chemical engineering and aerospace engineering – all courses where prospective students once faced stiff competition for places. Courses related to data and analytics, however, are rising in popularity, as are those on the environment. Going by A-Level grades, the bar to get into accountancy at the Nanyang Technological University (NTU), for instance, has steadily declined to BBC/C last year, from AAA/B in 2012. Up till 2016, at least 90 per cent of students who signed up to read accountancy at the National University of Singapore (NUS) scored straight As in their A-Levels. With the drop in interest since, ABB/B was enough to secure a spot last year. The picture is not too different at Singapore Management University (SMU), where BBC/C was also enough to snag a spot in the once-preferred course last year. It is now more difficult to enter SMU's business course, which required at least 4 Bs last year - never the case before 2019. Courses that run in the same leagues as law and medicine are, expectedly, those that set students up for a tech-driven career: computer science, data science and artificial intelligence (AI), and business analytics. Straight-A students have also increasingly looked to NUS' food science and technology programme, and NTU's environmental earth systems science programme, as viable options. Between 2019 and 2021, the 10th percentile profile of grades for the NUS course was consistently 4 As; for the NTU course, the grade profile was AAA/B in 2019, AAA/A in 2020 and AAA/B in 2021. The cut-off for NUS' environmental studies course peaked in 2016, with 4 As as the bar. This grade profile has stayed robust, with the 10th percentile student entering with AAA/C since 2017, though it dipped to AAB/B last year. These grade profiles, coupled with an apparent decline in interest in chemical engineering (which opens up career pathways in the petrochemical industries), could be a sign of students' interest in sustainability-related fields. Green turn: Several students The Business Times spoke to said as much. Wong Chun Hong, a 29-year-old PhD candidate in food science at NUS, said more straight-A students are entering the course due to the increased interest in alternative meats. \"The younger generation are more interested in trying to make a difference to the environment and society,\" he said. Yale-NUS College student Abery Lia Chan, 21, who picked environmental studies as her major based on her interest in policy-making and energy transitions, said students are looking for \"a better way to live on earth\". NUS environmental studies student Willis Lau, 24, said he initially accepted the university's offer of a place in the life science course, but switched to environmental studies because it is more aligned to his interests in geography and climate change. Now that he is graduating, he sees many doors open to him, with companies paying more attention to sustainability and ESG (environmental, social and governance), and the public sector embarking on the Singapore Green Plan 2030. Opportunities abound in research as well, he said, as more nations are looking to investigate nature-based climate solutions and carbon accounting methods that would help them fulfil their Paris Accord obligations. Data focus: Some straight-A students looking to make a mark in the business world have flocked to business analytics - a programme offered by NUS' School of Computing. At least 90 per cent of the more than 200 places available in the course over the past 3 years went to A-Level graduates with 4 As. Students of this course can pick up a financial analytics specialisation relevant in fields such as investments and fund management. Courses include Analytics for Capital Market Trading and Investment, Risk Analytics for Financial Services, Mining Web Data for Business Insights, Fraud Analytics, and Compliance and Regulation Technology. A 25-year-old NUS business analytics undergraduate who declined to be named said he hopes to join the consulting industry, and had picked the course for its combination of programming, statistics and business specialities. He believes this combination would not have been possible otherwise, saying: \"A general student from business and accountancy would be lacking the level of proficiency in programming as well as the statistical knowledge required to excel in the field such as data science.\" Donald MacDonald, newly appointed as OCBC's first head of group data office on Jun 1, believes the rush to data science began in 2012, when the Harvard Business Review called it \"the sexiest role of the 21st century\". OCBC's data teams work on challenges in all parts of the bank, including making stock market recommendations and helping to reduce financial crime, he said, adding that the variety is a big draw to many who join the ranks. \"Good scientists have to constantly learn to stay at the forefront of this cutting-edge field, and traditional graduate roles such as accountancy may not offer the same dynamism,\" he added. Remaking accountants: Commenting in his personal capacity on the apparent decline in interest in accountancy, corporate governance expert Mak Yuen Teen, an accountancy professor at NUS, said the latest grade profiles are of some concern. \"We need to look at our curriculum, professors, value proposition, and whether our accountancy and business degrees produce students who can think, solve problems and apply (what they learned) in the real world,\" he said. The drop in prestige of accountancy courses could also be due to a misunderstanding that the accounting profession could one day be replaced by artificial intelligence (AI). Said Mak: \"Maybe the profession as a whole needs to explain its value proposition in an AI world. Replacing manual work is not a bad thing at all, as accountants can move up the value chain in terms of value creation.\" Already specialists in generating, analysing, interpreting and using financial information, accountants are able to use their comparative advantage to step up and make sense of non-financial information, which has become just as important, if not more so, given the ESG push, he added. But he also recognised that the curriculum needs some catching up. \"Just as the accounting profession is getting more involved in setting sustainability standards and this whole ESG movement, our curriculum needs to change to reflect this,\" he said. \"ESG-related topics should be better integrated into the curriculum, and business schools should look at new offerings or majors in such areas.\""
    },
    {
        "id": "026",
        "title": "NTU launches interdisciplinary programme to study climate change",
        "content": "A new $50 million interdisciplinary research programme launched by Nanyang Technological University (NTU) on Wednesday will examine various aspects of climate change. The Climate Transformation Programme, which will be led by NTU's Earth Observatory of Singapore (EOS), will look to create climate solutions and educate future leaders to form a resilient and sustainable world. Speaking at a panel discussion of the programme at the EOS 15th anniversary celebration at Shangri-La Rasa Sentosa, Minister for Sustainability and the Environment Grace Fu said Singapore is modelling the impact of climate change both locally and regionally. \"This will help us to formulate in an iterative way solutions that will protect our people and protect our properties,\" she said. It will allow Singapore to be prepared for dry months and enhance resilience against inland flooding for very wet months, for instance, she added. She said the Government will share some of the findings with EOS and other agencies like the Meteorological Service Singapore, as well as its South-east Asian counterparts, so that they can be better prepared for varying weather patterns arising from climate change. The programme will be supported by a $50 million investment over seven years, with $47 million from the Ministry of Education and the remaining amount from NTU. Research will be conducted under six strategic clusters. For instance, the programme will look at the health impact from heat and air pollution fuelled by climate change, how climate change could affect business risks, as well as novel engineering solutions for climate adaptation. Giving some examples of the research programme, Professor Benjamin Horton, the director of EOS, said NTU has a partnership with insurance company Prudential to look into the health impact stemming from climate change and how it could affect one's life insurance. Another collaboration with luxury brand Chanel will help the company to diversify its supply chain, as increasing extreme weather events such as drought, forest fires and severe rainfall mean it would not be ideal to have all its suppliers in one location. Other aspects of the programme will examine how biodiversity such as flora and fauna responds to climate change, mapping out ways in which the world could get to net-zero through a negative emissions pathway, for example by planting trees, and to tackle knowledge gaps in understanding and modelling climate change. Three cross-themes -- sustainable societies, satellite remote sensing and artificial intelligence -- will integrate findings across the six clusters. The programme will bring together researchers across many different disciplines at NTU, and other local universities such as the National University of Singapore, Singapore Management University and the Singapore University of Technology and Design, and research centres across the globe. It is expected to recruit 30 doctorate students and close to 45 researchers for its projects over seven years, to develop climate leaders in fields ranging from the sciences to the humanities. Asked about the kind of knowledge gaps that the programme will seek to plug, Prof Horton told ST that while climate scientists are beginning to better understand the physical impact of climate change -- such as sea level rise, flooding and heatwaves -- it has yet to be properly quantified. For instance, little is known about how climate change could affect natural ecosystems from rainforests to mangroves, how it could affect construction workers, as well as the world's finances and energy use. Therefore, interdisciplinary studies -- bringing together scientists, geologists, social scientists and business students -- will be required to find solutions, he said. He noted that the new programme has come at a time of climate emergency -- with the first comprehensive health check of the Paris Agreement showing that countries must take more ambitious action to cut emissions and limit global warming to 1.5 deg C."
    },
    {
        "id": "027",
        "title": "NTU, NUS among world's top 50 research bodies most cited by key global innovators",
        "content": "Nanyang Technological University (NTU) and the National University of Singapore (NUS) are among the world's top 50 research organisations whose work underpins solutions created by major global innovators, says scientific intelligence firm Clarivate. The ranking is based on the number of research papers referenced in inventions by organisations in the 2023 edition of the Top 100 Global Innovators list released by the UK-based analytics firm on Thursday. NTU ranked seventh, with 1,013 papers referenced, while NUS was placed 22nd with 753 papers. Topping the list of research organisations was the Chinese Academy of Sciences in China, followed by the Massachusetts Institute of Technology and Stanford University in the United States. This is the first time that Clarivate has ranked institutions whose research was referenced by global innovators. These innovators include 3M, Airbus and Rolls-Royce. Clarivate has separately published its Highly Cited Researchers list for about a decade. Professor Luke Ong, vice-president for research at NTU, said the university's placing was a testament to its commitment to deepening interdisciplinary research that benefits mankind. \"Catalysing high-impact research and translating it into enterprising innovations that benefit industry and society are core tenets of the NTU 2025 five-year strategic plan,\" he said. Professor Chen Tsuhan, deputy president for research and technology at NUS, said the university is committed to staying the course in delivering research excellence that brings about tangible impact. \"We are proud that our research proves to have strong translational impact in pushing boundaries of innovation, and is making a positive difference on a global scale,\" he said."
    },
    {
        "id": "028",
        "title": "Compulsory internships for all NTU undergraduates starting this year",
        "content": "SINGAPORE - Internships will be made compulsory from August for all new students enrolling in the Nanyang Technological University (NTU). They will need to complete work stints from their second year that will count towards their graduation requirement. Students can complete them locally or overseas, and their work performance will be assessed. Internships will also be an option for graduate students. Currently, only some schools in NTU have such mandatory internships. These are the six engineering schools, the School of Biological Science, Nanyang Business School, School of Art, Design and Media, and Wee Kim Wee School of Communication and Information. NTU said about three in 10 of such stints - which vary from 10 to 20 weeks or longer - were converted into full-time job offers. Four more schools will require internships from August: Asian School of the Environment, School of Physical and Mathematical Sciences, School of Social Sciences and School of Humanities. Other institutions like the Singapore Management University and the Singapore University of Technology and Design have already made internships compulsory for all students. Internships are also a requirement for some National University of Singapore students, including those from engineering and computing. NTU president Subra Suresh said the university is exploring how to open up industry connections that it already has to students. This could come, for instance, through research internships at NTU's corporate labs that are jointly set up on campus with industry partners like HP Inc, Rolls Royce, Singtel and ST Engineering. There are currently 10 such labs, which generate new products and services through developing new technologies. Continuing education is another area that NTU is developing, as it expands courses for fresh graduates and adult learners to help them keep pace with work demands. It now has 39 MiniMasters certificates, which are microcredentials, in areas like early childhood education, business analytics and construction management. More on this topic Related Story: NTU introduces new core curriculum for 6,000 freshmen starting August. Related Story: NTU students can earn credits from taking online courses offered by top universities abroad. The course credits earned from this programme may count towards a full master's degree, which can be pursued later. NTU is also looking to strengthen teaching and learning practices across the university. It is setting up an Institute for Pedagogical Innovation, Research and Excellence, that will focus on a number of areas, including innovations like online learning and continuing education. Other initiatives under its NTU 2025 plan that was unveiled on Monday (Jan 25) are a new University Wellbeing Office that will from April provide support for employees and students, with mental health as a priority. The office aims to ensure timely intervention, improve counselling services, among other things."
    },
    {
        "id": "029",
        "title": "More AI chatbots for NTU, NUS to answer questions, boost efficiency and cut errors",
        "content": "SINGAPORE - There may be no such thing as a stupid question in schools, but there are questions with obvious answers. These questions, from students, make Assistant Professor Leonard Ng shake his head. Every day, educators at Nanyang Technological University (NTU) like Prof Ng receive a slew of e-mails from students seeking feedback on assignments or asking about upcoming tests. \"We get questions like, 'When's the exam?' or 'Should we turn up next week?' The answers are usually available online or in e-mails, but sometimes, students just don't check,\" he said. These inquiries tend to surge right before a test - often late at night as students cram for it during last-minute revision sessions. This is a problem for artificial intelligence (AI), Prof Ng thought, prompting him and a team of lecturers from NTU's School of Materials Science and Engineering (MSE) to develop Leodar, an AI chatbot that doubles as a teaching and administrative assistant. Leodar is among the earliest custom generative AI chatbots rolled out to students at NTU. Since its launch in January, e-mails from students have dwindled to just a handful per week for each tutor, down from several a day. Most queries are now handled directly by Leodar, which has answered over 12,000 questions from more than 150 users in 2024. This has freed up teaching staff to handle more complex queries, Prof Ng told The Straits Times. NTU is drawing inspiration from Leodar's success and will apply its approach to AI to future chatbots used across the rest of the university, through the NTU AI Learning Assistants Project. The project standardises chatbot development within faculties to minimise duplication. Leodar is managed by a team of tutors, who update the AI model's database with the latest course information, lesson notes and curriculum. The system is built in collaboration with Amazon Web Services, based on Claude, a large language model built by AI start-up Anthropic. The school is taking notes from the team's approach to building chatbots. This includes a coding technique called retrieval augmented generation, which confines the AI's responses to a pre-defined knowledge base, reducing the likelihood of AI making up its own facts. Prof Ng, who teaches data sciences and AI, said faculty members need to be familiar with programming and know how to update the assistant's knowledge database in order for a chatbot like Leodar to work reliably. The three tutors managing Leodar are able to view questions from students and can reply to them individually if they feel the AI has not provided good answers. MSE student You Yan Yan, 21, said Leodar has been the go-to chatbot for many students over the past year because its answers are specifically aligned with students' learning materials, including lessons on coding and mathematics. \"Other AI models like ChatGPT will give information from other sources, unlike Leodar, which uses materials taught in class,\" she said. As a best practice, MSE undergraduate Wang Tzu Wei verifies answers, especially for assignments, by checking answers or running the AI-generated code to spot any errors. Besides helping undergraduates with their studies, the AI assistant saves users the trouble of accessing the school website and opening multiple folders to find the details they need, said Mr Wang, 21. \"Now I just type a question and get the answers I want,\" he said, adding that the service allows students to ask last-minute queries, as tutors take time to reply. AI assistants are also being introduced in other educational institutions. The National University of Singapore rolled out a suite of AI tools in July called AI-Know, which can retrieve information on courses, research papers and school policies for staff. It plans to launch AI-Know for students in 2025 for college matters and as a study aid. The Institute of Technical Education (ITE) is testing an AI assistant that recommends topics for course curricula based on the latest job and market trends, and plans to extend its use to more teaching staff by early 2025, said ITE senior director of curriculum and educational development Eric Cheung. The assistant aims to speed up reviews of course curricula to ensure learning materials are relevant, he said. For instance, it analysed online sources on Singapore's ageing population and recommended incorporating skills in geriatric care into the curriculum for healthcare-related courses and suggested specific points within the teaching agenda for these topics. Dr Cheung said the technology is also being tested in a quiz generator for students, drawing data from existing course materials to create self-assessment modules for them. Osmond Chia is a technology reporter at The Straits Times, covering topics from cyber security and artificial intelligence to the latest consumer gadgets."
    },
    {
        "id": "030",
        "title": "Fresh tech graduates from Singapore unis bag highest starting pay of over $5,600: Survey",
        "content": "SINGAPORE - Mr Fazirul Hanafe was in his last year of studies at the Nanyang Technological University (NTU) in November 2021 when he landed a job as software engineer at social networking company Meta. In fact, it was one of four job offers on his plate by the time he ended school. The 26-year-old graduate, who has a Bachelor of Engineering degree in computer science, said: \"Once I got the offer from Meta, I stopped looking for other jobs... I felt that working at a large multinational corporation like Meta would give me exciting and challenging projects I could work on for my own growth.\" The recent job cuts in the tech sector in the second half of 2022 have been unnerving for fresh tech graduates like Mr Fazirul. More than 50 employees in Singapore are said to have been laid off by Meta as at November 2022. \"The possibility of being laid off three months into my first job is definitely worrying... From what I've seen, those who were laid off were not lacking in skills. It looked random,\" said Mr Fazirul. \"But I see now that they have new jobs... It's a competitive job market but I'm sure that the general tech sector is still hiring and these skills are still in demand,\" he added. This was borne out by the latest graduate employment statistics released by four autonomous universities on Monday. Fresh graduates of information and digital technologies courses commanded the highest starting pay among their peers at $5,625 in 2022, up from $5,000 in 2021. The overall median monthly gross starting pay of graduates across different sectors was $4,200 in 2022. The poll by the National University of Singapore, NTU, the Singapore Management University (SMU) and the Singapore University of Social Sciences also found that degree courses in information and digital technologies had the highest proportion of graduates in full-time, permanent work at 93.5 per cent, compared with the overall rate of 87.5 per cent. Observers said that tech graduates are still in demand despite the job losses in the sector. Mr Paul Heng, managing director of NeXT Career Consulting Group, said: \"It's likely that these fresh graduates were recruited during the annual career fairs that companies like to organise pre-graduation. We also need to take into consideration that companies that are firing might also be hiring - there are different job grades and types of jobs. Job seekers would not want to give Google, for example, a wide berth although they have been firing.\" CIMB Private Banking economist Song Seng Wun said: \"The media highlights the job cuts, but what we fail to realise is that this is taking place concurrently with other companies hiring... Overall, more businesses are still looking to hire than to fire. Tech is also not limited to the tech sector. It's ingrained in almost every modern business and across industries, from financial services and start-up space to aerospace, healthcare and travel.\" The recent job losses are part of a \"normalising\" of demand for services by certain tech firms which had aggressively hired during the Covid-19 pandemic, he said. \"Tech skills are still in demand... It's not the frenzy we saw in the pandemic, when these companies ramped up services, but there are jobs still out there.\" Mr David Leong, managing director of recruitment firm PeopleWorldwide Consulting, said tech graduates are still in high demand as they have critical skills in Singapore's digitalisation efforts. \"Laying off existing workers are pre-emptive measures by employers in anticipation of a gloomy outlook. It is more about trimming the cost structure for them. So rehiring those retrenched recently should not be a problem.\" Said Mr Fazirul: \"The skills we have as computing science graduates are also quite transferrable... You could be a software engineer, a product manager, a quantitative analyst, just to name a few roles.\" Ms Shafeeka Rahama Zakafar Raffik, who graduated from SMU in 2022 with a Bachelor of Science (Information System) degree, clinched a full-time role as a technology analyst in Citibank at the end of an internship with the bank. \"I'm definitely relieved to get a full-time job,\" said the 24-year-old who majored in business analytics and software development. \"Salaries have been rising in the sector and sometimes, there are concerns about how much future employers value our skill sets compared with our peers.\" She said the recent layoffs in the sector have reinforced the importance of being versatile and having diverse skills. \"In that sense, SMU taught us how to have a broader generalised set of skills and still be able to specialise in certain areas at the same time,\" said Ms Shafeeka. \"For example if demand for software development is low, I could move into artificial intelligence or machine learning. I could job hop within the industry.\" \"It also emphasised to me the need to upskill even after graduation, so that we stay relevant and can switch to other roles if necessary,\" she added. Tech industry trade association SGTech chair Wong Wai Meng said: \"We are confident that demand for tech talents will remain high in 2023, although growth may be more conservative than in 2022. The fundamental importance of tech for business transformation remains unchanged and will continue to fuel job growth in the year ahead. We should still see heavy demand for developers like software engineers, full stack developers and mobile app developers, and cybersecurity experts in 2023.\" Sustainability and digital trust are two key emerging areas for Singapore, he said, and this will bring about new needs for related tech expertise across many sectors, like data policy, digital ethics and green management solutions. \"We encourage tech graduates to adopt an adaptive mindset and keep their skills updated as technology evolves rapidly,\" said Mr Wong."
    },
    {
        "id": "031",
        "title": "Local unis focus on efforts that benefit society",
        "content": "They include research that matters to S'pore, support for student-led social enterprises. They are facing increasing competition from institutions abroad and the rising influence of global rankings. But Singapore's three largest publicly-funded universities have said they are still very much focused on building their Singapore identity and giving back to the country. Over recent years, universities here have been streaking up various world rankings. Just last month, the National University of Singapore (NUS) and Nanyang Technological University (NTU) were placed No. 1 and No. 2 in the latest Times Higher Education Asia University Rankings. But this has also raised questions on whether these institutions are tweaking their teaching and research models too much in order to fulfil criteria drawn up by foreign publications which rank universities. This was an issue raised by Acting Minister for Education (Higher Education and Skills) Ong Ye Kung at last month's The Straits Times Education Forum at Singapore Management University (SMU). While Singapore should be proud of how well its universities have done internationally, he also urged universities not to chase rankings \"blindly\". This could lead to the country having top-ranked universities which belong to the world but not to Singapore, he said. NUS provost Tan Eng Chye said despite doing well in these rankings, its strategic plans are not based on them. These tables capture only some aspects of a university's overall achievement, and are highly dependent on criteria used, he pointed out. Instead the focus is on staying relevant. \"We are trying to make sure that we strengthen our identity. Many universities do similar things - they award degrees and do research in similar areas. But how do we stand out?\" One answer is to pursue research that matters to Singapore and the region, a point echoed by SMU provost Lily Kong. \"Universities are part of the community they are located in... It is important that... what we do feeds back into society,\" she said. For instance, SMU has identified five areas of research that are relevant to Singapore - finance, analytics, innovation and entrepreneurship, ageing and healthcare management as well as urban management and sustainability. The last two were identified earlier this year. Prof Tan also highlighted how the National University Health System, which includes National University Hospital and three faculties - medicine, dentistry and public health - focuses research on illnesses such as gastric cancer and heart diseases, which are more prevalent among Asians. In recent years, the universities here have also paid more attention to local and regional social science research. For instance, NUS' Centre for Family and Population Research was launched in April last year. NTU also set up the Ageing Research Institute for Society and Education this year to help find solutions to Singapore's issues with an ageing population. NTU provost Freddy Boey said it also works closely with government agencies to help ensure Singapore's manpower needs in emerging areas such as engineering, healthcare and food science are met. There is also a big focus on applied research which will have a more direct impact on society. Prof Kong said about 40 per cent of SMU's faculty are doing this, and academics who do more \"blue skies\" or theoretical work are also encouraged to do applied research - even if it does less for their international reputation. \"Applied work is more difficult to publish internationally because it's about local issues. It's the work that may not get cited as much,\" she said. \"So universities have to be conscious... that we also recognise and reward this work.\" At the same time, faculty members here also sit on many national committees and are called upon to be consultants by government agencies and the private sector. \"In some universities around the world... academics write that it is a terrible thing to work with policymakers, you're sleeping with the devil,\" said Prof Kong, a board member of the Housing Board, a member of the Public Service Commission and a member of the National Arts Council's Arts Advisory Panel. \"Here, that tension isn't quite there.\" Another example is NUS professor Brenda Yeoh, the dean of its faculty of arts and social sciences, who sits on several panels in the National Heritage Board and is a member of the Urban Redevelopment Authority board. The universities said they also encourage students to be actively engaged in projects that will benefit society. NTU recently launched a fund to support community projects and student-led social enterprises. SMU's 2015 graduating class contributed 80 per cent more than the 80 hours of community work that was required. Said Prof Kong: \"It's not just about preparing them for employment... but educating these young people to have a sense of responsibility towards the community and society.\" The universities said they will evolve with Singapore to meet its changing needs and deal with changes such as technology. Said Prof Tan: \"We cannot stand still because the world moves very fast and if you stay with the status quo, sometimes the change of events may displace you. As a university you have to continue to look ahead, think ahead and move.\""
    },
    {
        "id": "032",
        "title": "Unis to offer more stints with start-ups overseas",
        "content": "Two local universities - Singapore Management University (SMU) and Nanyang Technological University (NTU) - have introduced programmes over the past year to allow students to intern at start-ups overseas while taking classes at partner educational institutions. These follow the National University of Singapore's Overseas Colleges (NOC) programme, which operates on a similar model and has been in place for over a decade. Many of its alumni have gone on to found successful tech companies, such as Carousell and PlayMoolah. Mr Nicholas Han, 23, was one of the 21 students in the pioneer batch of SMU's Entrepreneurship Immersion Programme, which lasted 10 to 12 weeks during the school's summer term. He picked up valuable soft skills from his internship at Rialto, a Belgian real-estate start-up. He saw how the founder focused on building a relationship with clients, instead of talking shop immediately. \"When you create a connection with someone, you are more likely to generate a response,\" said Mr Han, a third-year student. NUS plans to increase its annual intake of students from 200 to 300, and expand the number of locations in the programme from six to eight in the next few years. NTU, meanwhile, will be sending its pilot intake of students under its Overseas Entrepreneurship Programme (OEP) to China and Britain next year. This comes on the back of recommendations by the Entrepreneurship Review Committee and the shift towards entrepreneurship in the \"new economic order\", said Dr Lim Jui, chief executive officer of NTU Innovation and NTUitive, NTU's innovation and enterprise company. The Entrepreneurship Review Committee was set up in 2013 to boost the start-up scene here. Forty students have applied to join the OEP, under which they will intern for a year in a start-up while studying at a partner university, such as Imperial College in London or Tsinghua University in Beijing. NTU hopes to grow its yearly intake to at least 200 by 2020. SMU, too, is hoping to send more students abroad for its entrepreneurship scheme. Over the summer, its students were attached to Emory University in Atlanta in the US and iMinds in Flanders, Belgium, an infocomm technology research lab. They were also matched with start-ups in both places. Next year, SMU will be introducing two new locations - China and India. It hopes to send 40 to 60 students on the programme. Third-year SMU student Lee Teck Hui, 25, relished the creative aspects of his internship with Bioscape Digital, an American health tech start-up. \"Instead of adhering to the standard operating procedure if there was a problem, we got to experiment even if we weren't sure if it would work,\" he said."
    },
    {
        "id": "033",
        "title": "Local universities make strides in Times world rankings",
        "content": "NUS is No 26, rising three spots from last year; NTU is up 10 places at No 76. SINGAPORE'S two oldest universities have moved up the ladder in the latest edition of the Times Higher Education World University Rankings. The National University of Singapore (NUS) came in 26th on the list, up three rungs from 29th last year. The Nanyang Technological University (NTU) climbed 10 places to 76th - the third year in a row that it has risen in the table since finishing at 174th in 2010. The Singapore Management University was unranked because it is deemed a specialist university. The full list of the top 200 universities was released in London last night (4am today, Singapore time), once again unveiling California Institute of Technology in the US as being top of the pile. Commenting on Singapore's performance, Phil Baty, the editor of Times Higher Education Rankings, said: \"Singapore's reputation as one of the world's leading hubs for research and innovation and its ability to attract top academic and business talent suggest its rise will continue.\" In a statement, NUS president Tan Chorh Chuan said his university has maintained a strong focus on enhancing the value and impact of its work through continually raising the quality of the faculty and the impact of their teaching, scholarship and thought leadership. NUS also pioneers fresh approaches to education, such as that embodied by the new University Town campus and the setting up of the Yale-NUS College, he said. As for NTU, it scored a major coup this year by also emerging first globally for industry income and innovation, a sharp jump from last year's 15th position in that category. The university also improved its scores in citations per paper and international outlook. Its president Bertil Andersson said his university has, in the last few years, been rapidly ramping up its collaborations with the world's top multinationals and key industry players. The World University Rankings uses 13 performance indicators to measure a university's strengths in five areas - teaching, research, citation, industry income and international outlook. Overall, American universities took seven of the top 10 spots, and British institutions, the remaining three. The California Institute of Technology was the best of the lot for a third consecutive year. Harvard University and the University of Oxford came in joint second, and Stanford University fell two rungs to fourth. In Asia, Japan solidified its status as the region's top country in the rankings with five universities in the top 200, the best of which was the University of Tokyo (23rd). South Korea was a close second in the region with four representatives. Seoul National University broke into the top 50 for the first time at 44th position. While Europe can take heart that Oxford is the world's No 2, the continent in general fared poorly this time round; almost all its other top institutions - including the Swiss Federal Institute of Technology Zurich - lost ground. Mr Baty said: \"More Asian institutions are nipping at the heels of the best in the West, increasingly occupying world's top 50 places and showing no signs of letting up.\""
    },
    {
        "id": "034",
        "title": "Overall employment rate among local uni grads 'remains high': survey",
        "content": "OVERALL employment rates among the graduates of Nanyang Technological University (NTU), National University of Singapore (NUS) and Singapore Management University (SMU) remain high, the latest Joint Graduate Employment Survey conducted by the three universities has found. They had surveyed 10,126 out of their 13,656 fresh graduates, and found that as at last Nov 1, the overall employment rate was 89.1 per cent among those who were \"economically active\", the universities said in a statement. The phrase refers to those who are working, and those who are not working, but actively looking and available for work. And among the graduates, 82.7 per cent were employed in full-time permanent jobs within six months of the end of their final examinations. The overall and full-time permanent-employment rates for 2014 have stayed largely stable, compared to those in 2013, when this joint survey was also done. The annual survey also found that for individuals in full-time permanent employment, those who graduated in 2014 drew higher salaries than those who graduated in 2013. The mean gross monthly salary among last year's fresh graduates in full-time permanent employment was S$3,333, up from S$3,229 in 2013; the median gross monthly salary among them was S$3,200, up from S$3,050 in 2013. The NTU, NUS and SMU joint survey also included \"follow-up graduates\", that is, those who have completed their practical training - the one-year practical law course, pupillage or doctors' housemanship, for example - after their studies. About 640 out of 883 follow-up graduates took part; they included 2011's architecture graduates who had completed their practical training, and 2013's graduates in pharmacy, law, medicine and biomedical science. Of the economically-active follow-up graduates, overall employment rate was 98.9 per cent last year; 97.7 per cent had full-time permanent jobs. The mean gross monthly salary for follow-up graduates in full-time permanent jobs was S$4,751, up from S$4,575 in 2013; the median was S$4,800, compared to S$4,500 in 2013."
    },
    {
        "id": "035",
        "title": "SMU's move to diversify is a positive step",
        "content": "THE recent announcement by the Singapore Management University (SMU) to expand beyond being a business-focused institution is a move in the right direction - both for itself as well as for the wider higher-education landscape in Singapore. The university has said that it plans to set up a school of humanities in the next few years, where undergraduates will be able to study subjects such as history, literature and philosophy. SMU also suggested it will offer a full degree course in applied mathematics and may consider a liberal arts programme and residential college in the future. These constitute a progressive step for SMU that will take the university beyond the US-styled private business school it originally set out to be. To be sure, it would be unfair to compare SMU with any of these American business schools as a significant part of their reputation and credibility has been built through their post-graduate MBA and executive-level programmes. It is through such programmes too that these business schools have been able to build substantial and affluent alumni networks that have contributed generously to the endowment of the schools. Singapore currently has at least four well established business schools - French institution Insead, the Essec Business School, as well as business schools from the National University of Singapore (NUS) and the Nanyang Technological University (NTU). There are other smaller schools as well. For a relatively small potential student base in Singapore and the region, SMU may find itself in an increasingly crowded and perhaps saturated pool. Its move to expand its scope of offerings may thus also make good strategic sense. It is also noteworthy that many of the other specialised business schools - and not only in Singapore - operate within the framework of a broad university. The diversity of a student population on campus is a key factor that enriches the undergraduate experience and fosters richer learning - something that SMU can also achieve as it expands its programmes in multiple disciplines. More disciplines could also lead to wider choices for SMU in terms of partnerships and joint programmes with reputable universities from around the world. It would no longer be confined to partnering only other business schools. At the national level, SMU's possible move to create a liberal arts programme and residential college would add to the efforts underway to build a more diversified and creative workforce, from which employers, too, would benefit. The Yale-NUS college and the NUS residential colleges have been successful models and have helped not only to enrich campus life but also to enable undergraduates to enter the workforce better prepared with more varied skills. Thus, SMU would help meet the expanding aspirations of young Singaporeans. The greater the diversity of courses available to students at home - which will hopefully be accompanied by a greater availability of scholarships - the less likely they would be to look overseas for higher education. To some extent, this could also prevent, or at least reduce, a brain drain in the future."
    },
    {
        "id": "036",
        "title": "NUS, NTU named in top 100 in Reuters' list of world's most innovative universities",
        "content": "SINGAPORE - The National University of Singapore (NUS) and Nanyang Technological University (NTU) both climbed up the list of the most innovative universities in the world, according to a ranking compiled by news agency Reuters. NUS climbed five spots to rank 58th, while NTU made its first appearance in the top 100 of the global list to occupy the 67th position. The World's Most Innovative Universities list, which identifies and ranks the educational institutions doing the most to advance science, invent new technologies and power new markets and industries, was released on Wednesday (Oct 23). It is based on proprietary data and analysis including patent filings and research paper citations. Stanford University in the US held its position as No. 1. In a separate index that tracks contributions to research articles, NTU came in second while the Singapore University of Technology and Design was ranked 70th. The inaugural Nature Index Young Universities ranking, which lists the world's top universities aged 50 years or younger by their research output, was released on Thursday (Oct 24). In yet another ranking - the US News & World Report's Best Global Universities Rankings - released on Tuesday (Oct 22), NUS and NTU were ranked 34th and 43rd respectively. Last year, NUS came in 38th while NTU was 49th. Harvard University took the top spot again. Published annually, this year's Best Global Universities rankings assessed over 1,000 universities across 81 countries. The rankings are based on 13 indicators that measure the universities' academic research performance and their global and regional reputations. NTU president Subra Suresh said the university has \"consistently delivered in terms of research output, innovation and teaching excellence\". Said Professor Suresh: \"We have been very successful in attracting top talent from Singapore and from all over the world. Our commitment to excellence in both education and research has also been strong. Furthermore, in order to have impact, we need to make sure that research and education not just lead to academic excellence, but that they also contribute significantly to society.\""
    },
    {
        "id": "037",
        "title": "NUS, NTU's new ratings 'won't sway bosses much'",
        "content": "The National University of Singapore (NUS) and Nanyang Technological University (NTU) have shot up into the top 13 of an annual ranking of the world's top universities, but the fine showing may do little to improve their already strong reputation among employers here. In the latest World University Rankings, released by London-based education consultancy Quacquarelli Symonds (QS) on Tuesday, NUS and NTU came in at 12th and 13th respectively. Last year, NUS was placed 22nd, while NTU took 39th spot in the same global rankings. Recruitment consultants said graduates from Singapore's two oldest universities are highly sought after by employers, and the great leap may not necessarily drive up their already high employability. \"I am unsure how much higher their employability can get when it is already so near to the ceiling,\" explained Mr Adrian Tan, career coach at CareerLadder. He added that the stellar performance, however, might motivate companies beyond Singapore to look at NUS and NTU graduates as new pipelines of talent. \"But the rankings can change,\" he said. \"I would like to believe that employers choose the right person for a role, not necessarily the best one.\" Human resource experts say employers often consider attributes like initiative, teamwork and experience, such as from internships. Having a degree from a top-ranked university is merely a bonus. Mr Timolty Chai, senior consultant at Careerhub Consultants, said: \"Those with NUS and NTU degrees would have a slight advantage due to their reputation but, ultimately, it is important for candidates to show what they have to bring to their prospective employers.\" ManpowerGroup Singapore country manager Linda Teo added that employers' hiring preference often depends on the type of job, and if the degree is a match for that role. \"Whatever the pedigree of the university, it is the graduate's performance on the job that matters in the long haul,\" she said. However, most experts agreed that the stellar performance in the rankings would at least enhance the NUS and NTU brands globally, and convince more students, including foreign ones, to enrol at them. Hays Singapore's managing director Lynne Roeder said demand for graduates from local universities is \"extremely high\", adding: \"It is expected that there will be more A-level students choosing to stay in Singapore to pursue their degrees locally because of the employability and reputation.\" In the list, topped by the Massachusetts Institute of Technology (MIT) in the US, NUS and NTU placed ahead of established American powerhouses such as Yale University and the University of Pennsylvania. They are the only two Asian institutions to make the top 20. Pioneer Junior College student Darren Tan, who is taking his A levels this year, might consider taking up an engineering degree at NTU. \"We have one of the best education systems,\" said Mr Tan, 18. \"Prestigious universities like Yale and Cornell may have been popular choices among students because of their strong reputation, but now, NUS and NTU have caught up.\" The impressive gains made by NUS and NTU against their Western counterparts are partly due to an adjustment in the way research citation is assessed. But QS added that both institutions would have improved even without the change. Some academics believe that the two universities may just be able to climb further up the rankings. Dr Timothy Chan, director of SIM Global Education's academic division, said: \"Compared with established brands like MIT, Oxford and Cambridge, our universities are still young. But we are heading in the right direction.\""
    },
    {
        "id": "038",
        "title": "New SMU scheme benefits needy students",
        "content": "Since she was in secondary school, 21-year-old Joyce Lee has been pulling shifts in various retail or service jobs to save up for university. From gigs as a barista at McDonald's and as a service crew member at a sushi joint, Ms Lee has set aside about $10,000 over the years. But the incoming first-year student at Singapore Management University's (SMU) Lee Kong Chian School of Business was still worried about whether she would be able to afford tuition fees for the four years of study, which would come up to about $45,000. \"Even with bursaries and my part-time jobs, I am not sure if I will have enough money,\" said the eldest child of three from a single-parent family. Her mother is a cashier, while both her younger sisters – one in university and the other in polytechnic – are also working part-time. But when she accepted the offer at SMU earlier this year, she was pleasantly surprised to find out that her tuition fees will be fully paid for. She was one of 13 incoming first-year students at SMU who are the first batch of students to benefit from SMU Access. Launched in March, the scheme offers grants and scholarships to ensure that the tuition fees of its financially needy Singaporean undergraduates are fully covered throughout their four years in SMU. All 13 who received the grant this year also qualified for the scholarship component, called the Quantedge Foundation Scholarship. The bond-free scholarship is given to financially needy students with strong academic potential – conditional on them maintaining a cumulative grade point average of at least three out of four each year. Yesterday, the students attended an appreciation ceremony at SMU, where they received their scholarship certificates. All students who meet the qualifying criteria for SMU Access, based solely on students' household economic circumstances – such as per capita income and housing type – will be eligible for the grant. They do not have to go through additional interviews, and there is no cap on the total number of beneficiaries who can receive the grant. Most financial help packages for Singaporean undergraduates include loans, bursaries and work-study assistance schemes that provide them with part-time employment. The amount they get depends on their level of need based on family income and other factors. University undergraduates can also turn to loans offered by other agencies. But there are fewer of such schemes. One is the Ministry of Education's Tuition Fee Loan scheme, which covers up to 90 per cent of the subsidised fees that Singaporeans pay. The loan interest is calculated after graduation and the student is given up to 20 years to repay the loan. Under the Mendaki Tertiary Tuition Fee Subsidy scheme, Malay undergraduates whose monthly household per capita income does not exceed $1,500, among other conditions, can receive a subsidy of between 50 per cent and 100 per cent for their fees. The National University of Singapore (NUS) offers a wide range of bursaries, including the NUS Bursary which is at least $1,050 a year. The bursary is for one academic year, and students have to re-apply each time. Students living on campus can also apply for bursary grants ranging from $4,000 to $6,000 to defray the cost of accommodation. Similarly, the bursaries at Nanyang Technological University (NTU) are usually for one academic year, and students have to re-apply each time. The sum awarded is at least $1,350 for use in their studies and living expenses. The NTU Study Loan offers a full-time student up to $3,600 an academic year for living expenses. The loan interest is calculated six months after the student graduates or when he or she is employed. The loan has to be repaid within 20 years. SMU Access is seed-funded by an $8 million gift from local charity Quantedge Foundation, and will be supported through government grants, SMU funds and other donor gifts. Mr Suhaimi Zainul-Abidin, a board member of the Quantedge Foundation, said: \"We want to send a message (to all Singaporean students) that they should never be shy or have second thoughts about going to university (because of financial circumstances), as long as they qualify.\" Ms Lee, who used to work between 20 and 40 hours a week when she studied at Ngee Ann Polytechnic, said that the grant will allow her to put more time into her studies and pursue her interest in financial risk analysis as a career. Another Quantedge Foundation scholarship holder, 20-year-old Lee Wen Hui, said that receiving the grant was an \"unexpected gift\". \"I can stop taking allowances from my parents and also have more time for co-curricular activities like dance or a cappella singing,\" said Ms Lee, who wants to join the banking and finance industry."
    },
    {
        "id": "039",
        "title": "Two research centres at NUS, NTU set up to develop data protection tech in Smart Nation era",
        "content": "Two research centres have been set up to look into designing privacy technologies that can protect data throughout its life cycle and separately, provide businesses with off-the-shelf solutions to keep their data private. The centres, at the National University of Singapore (NUS) and Nanyang Technological University (NTU), have been given $22 million in total. Their mandate: to keep private data private in the era of the Smart Nation. Both centres were set up by the National Research Foundation Singapore. The Strategic Centre for Research in Privacy-Preserving Technologies and Systems (SCRIPTS), based at NTU, will be led by Professor Lam Kwok Yan, programme chair (secure community) at NTU Graduate College. The NUS Centre for Research in Privacy Technologies (N-CRiPT) will be affiliated with the NUS Smart Systems Institute. The centre will be led by Professor Mohan Kankanhalli, dean of the NUS School of Computing. N-CRiPT will work on preventing privacy leaks and coming up with solutions to protect data throughout its life cycle - from when it is created, to the point of its collection and curation, and all the way to its analysis and archiving. \"Privacy has been pushed to the forefront, especially with the recent cases of the SingHealth data breach, and the case of Cambridge Analytica, which affected people worldwide. There are two issues to be addressed here - security and privacy,\" said Prof Kankanhalli. In the Cambridge Analytica case, the firm was accused of taking the personal information of millions of Facebook users without permission to influence the United States election in 2016. Prof Kankanhalli said his team of 16 researchers is working to develop cutting-edge technology to prevent breaches. \"There is no magic wand that can solve all cyber-security problems. For different kinds of data, and the different adversaries working to obtain information of varying value, some solutions are already available, and some are not.\" For instance, technology developed by N-CRiPT might one day be used by health agencies and researchers to analyse medical data from clinics, or to study travel patterns obtained from transport and telecom companies without compromising an individual's privacy. Meanwhile, NTU's SCRIPTS will provide businesses with off-the-shelf solutions for privacy and computing. It will collaborate with Singapore cyber-security company i-Sprint Innovations to develop an e-logistics solution that will prevent counterfeiting, while ensuring commercial information remains private. The centre said this solution can be used for fast moving consumer goods, pharmaceutical and health products, luxury products, food supplies and more. A large amount of data is needed to develop more accurate analysis and insights. Prof Lam said SCRIPTS will develop ways for data to be collected and still protect the identity of individuals, thus ensuring their privacy. \"We at SCRIPTS will leverage on NTU's multidisciplinary research expertise in the areas of AI, data science, mathematics and cryptography, to investigate how we can solve privacy-preserving problems,\" he added. \"This tech, when developed, will enable the sharing of data without compromising privacy, thus allowing a bigger data set to be available, from hospitals, financial institutions and other businesses.\""
    },
    {
        "id": "040",
        "title": "NUS is Asia's best university again",
        "content": "The National University of Singapore (NUS) has been ranked the top university in Asia by the London-based Times Higher Education magazine for the second year in a row since the introduction of the category in 2013. It beat second-place Peking University and third-place Tsinghua University – both in China – in the latest Asia University Rankings 2017, published online early yesterday morning. Singapore's Nanyang Technological University (NTU) was ranked fourth, followed by the University of Hong Kong in fifth place. NTU slipped from the No. 2 spot, even though its overall score improved. The Times Higher Education Asia University Rankings is a ranking of Asia's best 300 universities from 24 places, including Japan, South Korea, India and Israel. It uses 13 performance indicators – such as research performance, teaching environment and research citations – to rank the universities. NUS president Tan Chorh Chuan said: \"We are pleased that NUS has once again been recognised as Asia's leading university in the latest rankings by the Times Higher Education. This is a strong recognition of our Asian and global approach to education and research, as well as the importance we place on making a positive impact on the nation and the community around us.\" Professor Tan added that NUS will strive to ensure that its education and research remain innovative and relevant to Singapore and the region. NTU president Bertil Andersson said of his university's achievement: \"The competition is, of course, much keener when you are at the top, with many similarly dynamic and ambitious Asian universities putting up a strong fight. Some fluctuations each year are not unexpected when you are in the top league. I'm happy that NTU has performed better and has higher scores compared to last year. Compared to two years ago, when we were placed 10th, we have made big strides up in the rankings, although not as much as last year.\" The editor of the Times Higher Education Rankings, Mr Phil Baty, congratulated NUS on retaining its position as Asia's top university for the second consecutive year despite \"very tough competition\" from Peking University and Tsinghua. He said: \"I predicted several years ago that NUS would reach the top, and the university really has established itself as the role model for the entire continent – demonstrating that with decisive leadership, a truly international approach and with the backing of government prepared to invest in higher education, Asian universities can legitimately challenge the traditional Western elites of the US and the UK.\""
    },
    {
        "id": "041",
        "title": "NUS loses title of Asia's top uni but scores in global outlook",
        "content": "The National University of Singapore (NUS) may have gone down by just one spot but, in the process, it has been knocked off its perch as Asia's top university by China's Tsinghua University in the latest Times Higher Education World University Rankings. In the rankings released last night, NUS slipped to No. 23, while Tsinghua University climbed eight places to No. 22. Last year, NUS tied for 22nd place with the University of Toronto in the annual list, and was ranked as the top Asian university for the third year running. It was also the only one from Asia in the world's top 25 universities list. Tsinghua University beat Beijing's Peking University to also become China's top university. Peking University was down four places to 31st. Nanyang Technological University (NTU) moved from the 52nd position to 51st this year. Times Higher Education magazine, which unveiled its latest rankings last night at the World Academic Summit in Singapore, said Tsinghua's rise is driven largely by improvements in its teaching environment, while Peking's decline is largely due to increasing competition and a drop in research income. Mr Phil Baty, editorial director of the Times ranking, said that NUS remains \"one of the most innovative and dynamic universities in the world\". He added: \"NUS has outstanding scores across all of Times Higher Education's core metrics, but it has one of the highest scores of all universities in the elite world top 30 for international outlook, demonstrating that NUS is a magnet for global talent, and a highly sought-after research partner for universities across the world.\" But he noted that the new rankings show strong competition from China. Seven Chinese universities feature in the top 200 this year, with several moving up in the rankings. He said China has positioned its universities at the heart of its national economic growth strategy. In contrast, traditional power regions such as America, Europe and Australia are experiencing the effects of deepening cuts and creeping isolationism. NUS president Tan Eng Chye said he was pleased that NUS continues to be recognised among leading universities in the world and in Asia. \"The nature of work is changing rapidly, and universities will need to innovate and evolve to effectively respond to the Fourth Industrial Revolution,\" he said. An NTU spokesman said the university was making steady progress. It has improved on the overall score from last year and ranks as the top university in Singapore for citations and industry income. The Times ranking - now in its 15th year - lists more than 1,250 higher education institutions from 86 countries this year. It uses 13 indicators - including research, knowledge transfer to industry and international outlook - to assess a university. Oxford University claimed the first position for the third consecutive year, while Cambridge retained its second position, and Stanford in the United States held steady in third place."
    },
    {
        "id": "042",
        "title": "Singapore 'could be global innovation hub'",
        "content": "SMU don among many in research community excited about five-year $19b budget for R&D. The country's plan to pump $19 billion into science and technology over the next five years could \"make Singapore a 'go to' destination as a global innovation and entrepreneurship hub\". This is the view of Professor Gerard George, dean and professor of innovation and entrepreneurship at the Lee Kong Chian School of Business at Singapore Management University (SMU). Like him, many in the research community have reacted positively to Research, Innovation and Enterprise (RIE) 2020, which was announced by Prime Minister Lee Hsien Loong last Friday. It will allocate $19 billion over the next five years towards developing Singapore as a knowledge-based, innovation-driven and future-ready economy and society. It is 18 per cent higher than the previous five-year budget of $16.1 million. The plan will see researchers having to compete more for funding, as well as more being done to take discoveries to market. \"I am pleased to see RIE2020 respond emphatically to calls for strengthening our entrepreneurial ecosystem and focus on commercialisation of technology and scaling it up for global markets,\" Prof George added. Research institutions here are geared up to tap into the opportunities offered by the new plan. For example, the National University of Singapore's Faculty of Engineering said its dean, Professor Chua Kee Chaing, has been \"promoting greater collaboration between engineers, clinicians and scientists in partnership with the National University Health System since the early 2000s\". The collaboration fosters the development of innovative technological solutions to healthcare challenges, the kind of multidisciplinary applied research that would be very much at home in RIE2020. The funding will focus on four core technological domains - advanced manufacturing and engineering; health and biomedical sciences; services and digital economy; and urban solutions and sustainability. Beyond these, Nanyang Technological University's (NTU) chief of staff and vice-president of research, Professor Lam Khin Yong, highlighted the $2.5 billion set aside for the so-called white space - to look into previously unanticipated emerging topics. Prof Lam said: \"In the past few years, NTU has been actively scanning the horizon to identify new areas of growth.\" He gave examples of recent advances made by the university in areas such as satellite development, new materials for clean technology, and renewable energy. In addition, Assistant Professor Cheong Siew Ann, deputy director of NTU's Complexity Institute, said that many of the challenges faced by Singapore are likely to be complex, and \"the most obvious 'solutions' could lead to unintended consequences\". This, he said, is where the relatively new field of complexity science, which studies how things behave when they are interconnected with one another, could offer novel solutions. \"I certainly hope to find opportunities within RIE2020 to grow and establish NTU as the complexity science hub in Asia,\" Prof Cheong added. When asked about the impact RIE2020 would have on early- and mid-career researchers carrying the baton into the future, Professor Thomas Magnanti, president of the Singapore University of Technology and Design (SUTD), said that youth has its advantages. The relatively young faculty and researchers at SUTD, for example, are looking for innovative ways to establish their careers and are less anchored on traditional research domains. \"Thus they are in a good position to move swiftly into the RIE-identified fields,\" he added. Overseas experts also gave RIE2020 the thumbs up, particularly as the enhanced budget comes at a time when many other countries are cutting back on research spending. Professor Robert Brown, president of Boston University and a member of the Research, Innovation and Enterprise Council (RIEC), praised the Government's commitment to research and development. He said: \"The United States deals with one-year budgets and, in good years, we actually have a budget... The government (here) does a tremendous job trying to execute that plan and is very self-critical about when they succeed and when they do not.\" PM Lee is chairman of the RIEC which is made up of Cabinet ministers and distinguished local and foreign businessmen and scientists."
    },
    {
        "id": "043",
        "title": "Invite-only career fair for top NTU students draws flak",
        "content": "Undergrads upset as only those with GPA of at least 3.75 or from scholar programmes invited. For graduating students, a university career fair can be a stepping stone to finding the ideal job. So the idea of an invite-only fair did not sit well with many Nanyang Technological University (NTU) students. Last month, the university held NTUtopia, which undergraduates said exclusively targeted those from scholar programmes or with a minimum grade point average (GPA) of 3.75 out of 5. In an e-mail invitation seen by The Sunday Times (ST), NTUtopia congratulated the students on being \"selected\" for a \"premium by-invitation event for top employers to engage and recruit our brightest final-year students\". While the criterion was not explicitly stated, some undergraduates who did not fall in the categories said they were not aware of this event until their friends who received the e-mail spoke about it. However, Professor Tan Ooi Kiang, NTU's Associate Provost (Undergraduate Education), said about 3,600 students, or 60 per cent of the graduating cohort, were invited to the fair based on their achievements in academic or co-curricular activities. Some undergraduates who wrote in on their own accord and some who turned up at the event also joined the fair, he added. At the fair, students were allowed to pass their resume to participating employers from both the public and private sectors. NTUtopia said in the e-mail: \"It means you may even get a chance to secure a job way before your graduation... This will definitely help you get ahead of other candidates to increase your employability.\" Among the participating employers from the public service were the Ministry of Education (MOE) and the Infocomm Media Development Authority. A final-year NTU undergraduate with a GPA of 4.37 who went for the career fair told ST that organisers checked resumes and GPAs at the door. The student, who declined to be named, said: \"I asked (the organisers) why they set a minimum GPA and was told that they wanted to ensure the students were of a certain calibre. If it's a career fair, everyone who's graduating should be allowed to go... I don't think GPA is a good reflection of your quality of work.\" Prof Tan said: \"We will review students' feedback, including making NTUtopia open to all undergraduates, and the processes around NTU's career events. We'll also work with employers to widen their recruitment criteria to include those with more diverse skills and abilities.\" Spokesmen for the National University of Singapore and Singapore Management University told ST that they do run smaller-scale career fairs for students from specific faculties and areas of study, but there were no restrictions in terms of grades. A spokesman for the Public Service Division - the central body dealing with human resource and career development in the civil service - said individual public agencies were responsible for recruiting employees as the agencies better understood their own needs. In the private sector, companies that participated in NTUtopia, such as OCBC and DBS, said they regularly participated in a wide range of career fairs across universities. MOE said organising exclusive career fairs could \"send the wrong message, and our education institutions should avoid that\". It added: \"We encourage employers to look holistically, beyond grades, in their hiring decisions and to work with us to broaden the definition of success beyond academic results.\" Last month, MOE announced a slew of changes to exams and assessments at primary and secondary school levels. Education Minister Ong Ye Kung had said then that the motivation was to move away from an over-emphasis on grades and help students discover the joy of learning."
    },
    {
        "id": "044",
        "title": "Making university learning more enjoyable",
        "content": "FOR a society that's widely seen as achievement-oriented, better known for its hard-driving pursuit of merit than for merry-making, recent policy changes by two Singapore universities on the easing of grade requirements for students have been surprising, to say the least. In May, National University of Singapore (NUS) announced that incoming freshmen would be able to purge poor grades in up to five modules in their first semester from their records. NUS has also lowered the entry criteria for its honours courses in four schools, and will rename the degrees, doing away with the first-, second- and third-class classifications in favour of US-style \"distinction\" or \"merit\" designations. Nanyang Technological University (NTU) also said last week that it will allow its freshmen to drop F grades in up to six courses in the first year so as not to tarnish their grade-point average. The idea is to reduce the pressure on students and shift the focus away from grades, with NUS in fact mulling the possibility of an entirely grade-free first year. And in the case of its honours programmes, NUS said the easing of entry requirements is to enable more students to graduate with honours. Both universities insisted that their moves would not lead to a decrease in the quality of graduates. Indeed, given Singapore's rigorous and demanding education system, typically seen as too focused on exams and grades, the latest changes in NUS and NTU would seem like a breath of fresh air, and may well be the way to go as the local tertiary scene evolves in line with global norms. Yet, questions also arise, especially in light of another recent and somewhat controversial change: a new scaled-down Individual Physical Proficiency Test (IPPT) for military men, to enable more of them to pass the fitness test. Are young Singaporeans too mollycoddled? Where does one draw the line between being responsive to changing circumstances and pandering to populist demands? To be sure, policies, even entire systems, should be periodically reviewed – and it happens that the policy changes in these instances would result in an \"easier life\" for undergraduates and for servicemen. The longer-term effects though – on the quality of tertiary education here, on the fitness and \"operational readiness\" of a new generation of soldiers – remain to be seen. In the university scene, at least, there could be grounds for optimism. The shift away from a strict focus on grades, the overall kinder climate to encourage enjoyment of learning, is in line with the longer-term goal of getting more Singaporeans into university. From the perspective of manpower training, the better educated the population, the better for the economy. Singapore is looking at having 40 per cent of each cohort in university by 2020, up from sub-30 per cent today. And most students, one would think, would want to do well, not just aim to scrape through, particularly when they would need to compete in the job market soon after."
    },
    {
        "id": "045",
        "title": "NUS students can pursue a major in performing arts from August 2024",
        "content": "SINGAPORE - Undergraduates at the National University of Singapore (NUS) will have the option to take a second major or minor in performing arts, as part of a new initiative by the university to integrate art into their learning. Credit-bearing performing arts courses, currently offered for four groups – Chinese dance, Chinese orchestra, symphony orchestra and wind symphony – have been available to students since August 2023. These help fulfil elective requirements for undergraduate education, said NUS in a Feb 7 statement. More than just artistic performance, students are assessed on active contribution, engagement, and collaboration. Instead of lectures or seminars, each group follows regular training routines such as combined rehearsals and sectionals. About 160 students are currently enrolled in these credit-bearing groups, and NUS hopes to expand the number of eligible groups, out of 32 currently managed by the Office of Student Affairs' Centre for the Arts (CFA). Starting August 2024, these course credits can count towards a second major or minor in performing arts, as part of NUS CFA’s broader 'Arts For All' move to promote arts participation and interdisciplinary learning. Students may engage in the arts at four levels: affiliate activities (student-led groups), non-credit bearing structured engagements, credit-bearing group activities, or pursue a second major or minor. Associate Professor Chan Tze Law, NUS vice-dean of students and overseer of CFA, said this spectrum approach allows students from all backgrounds to participate in the arts, with entry-level groups potentially evolving into formalised, better-funded groups. Groups can be recognised as credit-bearing when they show exemplary creative output and rigorous training. Prof Chan noted that having flexible academic recognition will benefit students pursuing creativity-focused careers and highlight their artistic commitment. Chinese orchestra member Huang Chao Hung, 23, a second-year data science student, said the curriculum teaches valuable skills like concert planning and audience engagement. While grading can be stressful, he said it motivates students and supports exploration in a safe environment. Life sciences student Yong Fong Sin, 23, from the Chinese dance troupe, said grading is a form of acknowledgment for his efforts and recognition for Chinese dance as an art form. Prof Chan added that students should integrate academic and artistic passions seamlessly. Trumpet player Sharmila Selvam, 21, from the wind symphony and a second-year engineering student, hopes the initiative sustains student interest in the arts and improves accessibility. Computer science student Ang Xien Xu, 21, who plays violin in the symphony orchestra, expressed hopes for more collaboration and performance opportunities across groups. He said, 'There is something magical about making music with others, where we can express ourselves without words and connect with each other. Here's to a future where our passion for the arts can flourish, and our shared love for performing art goes beyond any grading system.'"
    },
    {
        "id": "046",
        "title": "NUS introduces Wednesday afternoons off and new sports hostel in push for holistic education",
        "content": "SINGAPORE - Most students from National University of Singapore (NUS) will enjoy Wednesday afternoons off starting August 2024, as part of a new initiative called NUSOne aimed at providing a more holistic university experience. This move is designed to ease freshmen’s transition into university and encourage self-directed personal growth and development from the first year. NUS accepted over 7,400 freshmen in 2023. Most undergraduates will have a protected time slot from 3 to 6pm on Wednesdays for student activities, with exceptions for classes requiring special venues like labs. More access will be introduced as NUSOne is progressively rolled out. NUS also announced Valour House, a sports-themed hostel opening in August 2025 at Kent Ridge campus, near the university’s sports centre. The hostel will accommodate up to 600 residents, with half of the places reserved for athletes and those with sporting excellence. Valour House aims to build an active and inclusive community through shared athletic experiences, with students organizing sports events for the wider NUS community. With its opening, total on-campus hostel capacity will increase to 12,500. NUS said this move brings it closer to offering every undergraduate at least one year of on-campus living and learning, especially in their freshman year. Currently, about two-thirds of first-year students apply for campus housing, and the majority receive rooms. Professor Aaron Thean, NUS provost and deputy president of academic affairs, said NUSOne emphasizes both academic excellence and holistic education. He noted that strong first-year experiences shape students’ attitudes and performance throughout their university years. Starting August 2024, NUS will also introduce a new 'Transition to Higher Education' programme offering freshmen essential skills and resources. This includes four new non-credit-bearing courses and two mandatory courses covering emotional awareness, respect and consent culture, academic integrity, research ethics, learning strategies, and generative AI. Freshmen will also receive a toolkit and roadmap with information about course registration and available extracurricular activities. Second-year civil engineering student Ms Dewi Wulandari, 20, shared that she initially found it challenging to manage course registration and explore extracurriculars. Help from seniors at orientation camp led her to join NUS Silat. She said that the new Wednesday free time could allow students to train earlier, rest midweek, or pursue other interests, helping support their mental well-being. NUSOne builds on prior educational reforms such as interdisciplinary curriculum changes and enhanced arts support. In March, NUS introduced the option for students to take a second major or minor in performing arts. NUS was ranked 8th globally and 1st in Asia in the 2025 Quacquarelli Symonds (QS) World University Rankings."
    },
    {
        "id": "047",
        "title": "Universities play critical role in social compact: DPM Heng",
        "content": "They should not be ivory towers, but catalysts to create a better world, he says. Universities like Nanyang Technological University (NTU) play a critical role in providing educational access to those who might otherwise not have the opportunity, Deputy Prime Minister Heng Swee Keat said yesterday. Over the years, NTU had taken in students from diverse backgrounds through bursaries and scholarships, helping to strengthen the social compact, he said. Just as important, he added, was the role NTU students and alumni played in giving back to society. In a video address at NTU's 30th anniversary dinner, Mr Heng said: 'To each generation of NTU students and faculty, I urge you to continue to change our society and the world for the better. Universities should not be ivory towers. They should instead be catalysts to create a better world.' Mr Heng added that NTU had made good progress over the past three decades, now ranking among the top universities in the world. 'Looking ahead, the pace of change will be even faster and the waves of disruption much larger,' he said. One of these waves is society – the need to forge a stronger social compact. Mr Heng noted that 'the social compact is under stress in many societies. Disparities are widening, and many communities feel excluded from progress. Singapore is in a better position, but we are not immune to some of these forces.' This concern was also highlighted by Deputy Prime Minister Lawrence Wong earlier in the week with the launch of Forward Singapore, an engagement exercise between the Government and citizens to refresh the social compact and shape the country's future. NTU president Subra Suresh announced that the university had raised more than $1.1 million through its 30th anniversary celebration activities. Speaking at the anniversary dinner at NTU's newest sports hall, the Wave, Prof Suresh said the funds – raised from more than 4,000 donors – were collected through the NTU We Belong campaign, which ran from Jan 22 to March 31. The campaign included NTU Service Week (with about 600 volunteers and 30+ community partners), Best Foot Forward (a virtual run totalling 37,000km from 1,000 runners), and NTU Giving Day (which celebrated the impact of giving across the university community). The $1.1 million will go toward financial aid for students and support for university colleges, schools, and initiatives such as the NTU Priorities Fund, School Advancement Funds, and the NTU Sustainability Fund. NTU began its anniversary activities in September last year, including a digital time capsule, a public exhibition, and a limited-edition book launch. Concluding his speech, Prof Suresh urged: 'Reflect on the communities around you and what they mean to you. You build a community, and then it builds you. It nourishes you with friendships and purpose. This is how greatness is achieved – not by individual effort, but by the collective strength and cumulative impact of small victories – as demonstrated by the rich heritage and remarkable accomplishments of Nanyang Technological University.'"
    },
    {
        "id": "048",
        "title": "NTU and Imperial College to set up research hub, expand student exchange programmes",
        "content": "SINGAPORE - Students at Nanyang Technological University (NTU) will soon have more opportunities to go on exchange programmes and undertake joint research with Britain's Imperial College London, the two institutions said in a statement on Wednesday. The institutions will also establish a research hub called the NTU–Imperial Health, Sustainability and Technology Hub as part of an agreement expanding the collaboration between them. The agreement was inked on Wednesday at NTU by its president, Professor Subra Suresh, and his Imperial College counterpart, Professor Hugh Brady, who is on his first visit to NTU. The pair have been working together for some time, establishing the Lee Kong Chian School of Medicine housed in NTU that officially opened on Aug 28, 2017. Prof Louis Phee, vice-president for innovation and entrepreneurship and dean of the College of Engineering at NTU, said the institutions would be increasing mobility of students between them with more opportunities for undergraduate exchange programmes, allowing a wider group of NTU students to spend time at Imperial under joint programmes. 'Currently, Imperial is one of the partner universities for students in NTU’s Renaissance Engineering Programme, who get to spend a year of their study overseas. The expansion of joint research activities between NTU and Imperial that aim to tackle global challenges also allows NTU postgraduate students the opportunity to go on more research stints at Imperial,' added Prof Phee. The new research hub will focus on collaborative research between the two institutions in fields such as artificial intelligence (AI) and robotics for healthcare, healthy cities and pollution, energy and sustainability, and infectious disease modelling, the joint statement said. It will be housed in existing buildings in both universities. Prof Suresh said NTU and Imperial enjoy a longstanding and close relationship, and that entering this new strategic partnership underscores the depth of cooperation between the two. He said: 'The NTU–Imperial research hub, established as part of our new partnership, will support both universities as we pursue research aimed at tackling some of humanity’s grand challenges.' Prof Brady said the new research hub will help seed the most ambitious projects and ideas in healthcare, sustainability and technology. He said: 'From tackling pollution in our cities, to developing future transport and using AI to improve healthcare – the hub will enable UK and Singaporean scientists to work together for the benefit of society.'"
    },
    {
        "id": "049",
        "title": "NTU and Imperial College to set up research hub, expand student exchange programmes",
        "content": "SINGAPORE - Students at Nanyang Technological University (NTU) will soon have more opportunities to go on exchange programmes and undertake joint research with Britain's Imperial College London, the two institutions said in a statement on Wednesday. The institutions will also establish a research hub called the NTU–Imperial Health, Sustainability and Technology Hub as part of an agreement expanding the collaboration between them. The agreement was inked on Wednesday at NTU by its president, Professor Subra Suresh, and his Imperial College counterpart, Professor Hugh Brady, who is on his first visit to NTU. The pair have been working together for some time, establishing the Lee Kong Chian School of Medicine housed in NTU that officially opened on Aug 28, 2017. Prof Louis Phee, vice-president for innovation and entrepreneurship and dean of the College of Engineering at NTU, said the institutions would be increasing mobility of students between them with more opportunities for undergraduate exchange programmes, allowing a wider group of NTU students to spend time at Imperial under joint programmes. 'Currently, Imperial is one of the partner universities for students in NTU’s Renaissance Engineering Programme, who get to spend a year of their study overseas. The expansion of joint research activities between NTU and Imperial that aim to tackle global challenges also allows NTU postgraduate students the opportunity to go on more research stints at Imperial,' added Prof Phee. The new research hub will focus on collaborative research between the two institutions in fields such as artificial intelligence (AI) and robotics for healthcare, healthy cities and pollution, energy and sustainability, and infectious disease modelling, the joint statement said. It will be housed in existing buildings in both universities. Prof Suresh said NTU and Imperial enjoy a longstanding and close relationship, and that entering this new strategic partnership underscores the depth of cooperation between the two. He said: 'The NTU–Imperial research hub, established as part of our new partnership, will support both universities as we pursue research aimed at tackling some of humanity’s grand challenges.' Prof Brady said the new research hub will help seed the most ambitious projects and ideas in healthcare, sustainability and technology. He said: 'From tackling pollution in our cities, to developing future transport and using AI to improve healthcare – the hub will enable UK and Singaporean scientists to work together for the benefit of society.'"
    },
    {
        "id": "050",
        "title": "NUS to expand entrepreneurship scheme that has created unicorns",
        "content": "A programme credited with seeding the start-up community in Singapore is being expanded. The National University of Singapore Overseas Colleges (NOC) programme, which sees students going to work in start-ups in more than 15 locations abroad, will cater to more students — gradually expanding its current annual capacity of 300 to 600 in five years. While the programme already sends students to places such as Silicon Valley, New York, Stockholm, Tel Aviv and Shenzhen, the National University of Singapore (NUS) will add more business and innovation nodes in the United States, Europe, China and South-east Asia. Among the new destinations in Europe is Paris, where the first batch of 20 NOC students will go in January 2023. The city was picked for its start-up ecosystem in Europe, and for reinventing retail and the food industry through technology. NUS president Tan Eng Chye said the new locations will be aligned to industries of strategic value to Singapore, and the hope is that NOC will produce talent who can innovate within those areas. This means offering a more thematic approach within certain locations and plugging into their specific strengths, be it artificial intelligence (AI) in Toronto, medtech in Boston, maritime tech in Norway, or agritech and food tech in the Netherlands. Professor Tan highlighted agritech and aquaculture technologies, which are among the areas that NUS wants to contribute to in terms of producing research and talent who will innovate in the field. He said: 'Considering our space and resource constraints, Singapore is vulnerable to external developments in the global food supply chain — hence the \"30 by 30\" goal to produce 30 per cent of the population's nutritional needs locally by 2030.' The expansion plans come one year after two NOC student start-ups — Carousell and PatSnap — attained \"unicorn\" status in 2021, reaching US$1 billion (S$1.4 billion) in valuation. Before 2021, several NOC start-ups made successful exits after being bought up for millions of dollars. They include tenCube, which made $25 million for its founders in 2010, and Zopim ($37 million) four years later. Prof Tan said NOC has historically been exclusive to NUS, but recognising the synergy that can occur when different communities come together, the university is opening the programme to students from other institutions. In 2022, three Singapore University of Technology and Design students were the first external participants admitted to the programme. 'Many of our NOC alumni entrepreneurs met their co-founders while on the programme, so we expect to see cross-institutional start-ups emerging as a result,' Prof Tan added. NUS is also looking to draw more of its postgraduate research students. Prof Tan said several PhD students have seized the opportunity presented by the Graduate Research Innovation Programme. It was launched in 2018 to guide postgraduate students on turning their research ideas into inventions, using them to create deep-tech start-ups based on cutting-edge technologies to solve urgent problems. NUS currently has more than 10,000 students pursuing PhDs and master's degrees, he added, noting that many research students, especially in fields such as engineering, science and technology, often work on breakthrough technologies for their theses. Their ideas and inventions can be developed further and taken to market. Prof Tan said NUS Enterprise, the entrepreneurial arm of the university, will further build up its ecosystem to support local and global start-ups by students. For instance, Block71, an incubation and networking space first set up in a retrofitted flatted factory in Ayer Rajah, has also been set up in San Francisco, Jakarta, Bandung, Yogyakarta, Ho Chi Minh City, Suzhou and Chongqing. NUS is now eyeing a similar move in Guangzhou and Nagoya. The different locations of Block71 offer more than just space. They also provide a range of services, including mentorship with entrepreneurs to help the students tap start-up communities around the world, said Prof Tan. He noted that The Economist magazine referred to Block71 as the heart of Singapore's technology start-up ecosystem and 'the world's most tightly packed entrepreneurial ecosystem'. Professor Shih Choon Fong, who launched the overseas colleges in 2002 when he was NUS president, said it is important that NOC is renewed to suit the times. 'Twenty years on, the world is a different place... There are many new entrepreneurial nodes in the world and profit is not the only objective, but also social inclusion and sustainability,' he said. 'NOC needs to be renewed once again. It will need new leaders, new vision, new ideas, but above all, it needs to re-envision the challenges and opportunities posed by a different world.'"
    }
]