[
    {
        "id": 1,
        "title": "NUS enters top 10 in global university ranking for the first time",
        "content": "SINGAPORE – The National University of Singapore (NUS) has broken into the top 10 in a global ranking of institutions for the first time. It emerged eighth in the latest Britain-based Quacquarelli Symonds (QS) World University Rankings 2024 released on Wednesday. It was previously 11th in the 2023 edition, which was released in 2022. It is the highest-ranked Asian university and the first from Asia to be placed among the top 10 in the table, which is dominated by universities from the United States and Britain. The chart is topped by the Massachusetts Institute of Technology, as it was in previous years, followed by the University of Cambridge and University of Oxford. Harvard University is fourth, and Stanford University fifth. The latest QS ranking is the 20th edition and features updated methodology using three new metrics – an institution’s commitment to sustainability, employment outcomes, and international research network. QS has also made some changes to the weighting of some existing indicators: academic reputation, employer reputation and faculty-to-student ratio. For example, academic reputation is now worth 30 per cent, down from 40 per cent, while employer reputation is accorded 15 per cent instead of 10 per cent previously. NUS came in seventh for employment outcomes and 15th for academic reputation. It ranks 54th globally for employer reputation and 64th for citations per faculty, which measures research impact. In a statement, NUS president Tan Eng Chye said: “This is a historic first for NUS to be placed within the top 10 globally, amongst many other prestigious institutions worldwide. This is a testament to our capabilities and commitment to providing a world-class and interdisciplinary education to nurture agile and resilient graduates with diverse skills and knowledge for an ever-changing world.” He added: “This achievement was made possible by the excellent contributions and outstanding work of our talented faculty, staff and students who remain deeply committed to flying the flag of our distinguished quality of education and creating positive impact in the classroom and beyond.” QS chief executive Jessica Turner said: “This unprecedented milestone marks a remarkable moment for Asian higher education and showcases NUS’ dedication to research excellence, innovation and sustainability.” Nanyang Technological University was ranked 26th in the latest table, down from 19th in the previous edition. Singapore Management University was in 545th position, and the Singapore University of Technology and Design made its debut in 429th place."
    },
    {
        "id": 2,
        "title": "NUS and NTU cast wider net for students through aptitude-based admissions",
        "content": "SINGAPORE - The university admissions period is ongoing, and applicants from polytechnics and junior colleges (JCs) are awaiting the results of their applications.\n\nThe good news for them is that in 2024, both the National University of Singapore (NUS) and Nanyang Technological University (NTU) are casting a wider net to consider more applicants through aptitude-based admissions, where achievements and talents outside of academics are considered. The two universities are increasingly employing a broad set of qualitative assessments, including interviews, aptitude tests and portfolios, to assess an applicant’s potential beyond his or her grades.\n\nThey also take into account achievements in sports, arts, entrepreneurship and volunteer work. For students who have experienced setbacks, they ask how these were overcome.\n\nNUS and NTU took in the bulk of the 18,500 students admitted into the six publicly funded universities in 2023, with NUS taking in more than 7,400 freshmen and NTU taking in 6,400 students.\n\nNTU said that in 2023, more than half – 57 per cent – of its 6,400 freshmen were offered places based on aptitude-based admissions. This was up from about a third of students, or 38 per cent, in 2019.\n\nNUS declined to provide figures on the proportion of its freshmen in 2023 who were accepted through aptitude-based schemes. It would only say that the number increased significantly compared with five years ago.\n\nThe university said it has also expanded its holistic admissions process by introducing special schemes aimed at identifying applicants with specific talents and aptitudes. One of the first of these schemes, launched in 2019, is the Polytechnic Entrepreneurship Pathway nomination scheme, where NUS asks the five polytechnics to nominate students who display a strong entrepreneurial inclination during their diploma studies.\n\nNUS said that over the past few years, it has launched similar nomination schemes, for example, to identify JC students who have demonstrated strong aptitude for computing despite facing exceptional circumstances or challenges. In 2023, NUS introduced a scheme for polytechnics to nominate students with potential in social work. In 2024, it is expanding the scheme to include JC students.\n\nNUS dean of admissions Goh Say Song said that since 2023, NUS has asked all applicants to respond to five short questions, including questions on their proudest achievement and what is meaningful to them. He said prior to that, students were asked to include a personal statement, but it was optional.\n\nProfessor Goh said: \"So, currently, if a reasonably good student falls short in some way, we will go back and look at the responses to the five questions. In this way, we are giving more students the opportunity to be considered beyond their grades, using broader criteria.\"\n\nOfficials from both universities stressed that aptitude-based admissions do not mean that they do not take academic grades into account, as admission dons still look at whether an applicant will be able to handle the rigours of degree studies.\n\nApplicants also have to meet the minimum grades for subjects related to the course of study. To study mechanical engineering at NUS, for example, an H2 pass in mathematics or further mathematics is required. For law, at least a B in General Paper is needed.\n\nExplaining why NUS is in favour of going beyond grades, Prof Goh said: \"Academic grades can only tell you so much about a student. Through the interviews, portfolios and aptitude tests that NUS uses, the university can assess their interests and aptitude for a particular field.\"\n\nHe added: \"We are also keen on those with talent in the arts or sports. It adds to the vibrancy of the NUS student body.\"\n\nNTU provost Ling San said aptitude-based admissions enable NTU to assess a bigger pool of students with a wider range of academic abilities, and offer places to those whose strengths are better aligned with the university’s academic offerings.\n\nProfessor Ling said: \"For the university, aptitude-based admissions benefit the wider student community by allowing for greater diversity on campus and fostering inclusion, enthusiasm and excellence.\"\n\nTwo NTU freshmen who were selected after having gone through aptitude-based admissions said they were grateful that Singapore’s two biggest universities are increasingly applying broader criteria in selecting students.\n\nNTU undergraduate Edwin Chew, 24, who is in the Singapore men’s national handball team, was glad that his university took into account his sporting achievements when considering him for a place in the maritime studies degree course.\n\n\"I started playing handball in Secondary 1 and have grown to love the sport. And I am proud to be part of the Singapore team that won medals at some significant competitions, including the SEA Games. I never thought that one day my sporting achievements would land me a place in a university when my results fell slightly short of the entry requirement.\"\n\nMs Nishaa C., 24, who did poorly in JC but excelled in her polytechnic studies after her A levels, said NTU took into account how she overcame the challenging circumstances she faced to go on to do well at Republic Polytechnic. She also stood out for her contributions to community involvement projects at the polytechnic.\n\n\"I did poorly in JC because I had to work to help support my family, which meant that I had little time for my studies. But I did much better at Republic Polytechnic, although I had to work daily at my father’s hawker stall to help him. So, although my grade point average was a little below the entry score for the Bachelor of Science degree, they took into account my family challenges, as well as the community involvement projects that I was involved in,\" she said.\n\n\"If not for aptitude-based admissions, I would not have had the opportunity to show that I am deserving of a place in NTU.\""
    }
]